const List<Map<String, dynamic>> EthicalHackingQues = [
  {
    'question': 'ما هو الهدف الرئيسي للاختراق الأخلاقي؟',
    'options': [
      'سرقة البيانات',
      'حماية الأنظمة واكتشاف الثغرات',
      'تعطيل الأنظمة',
      'نشر البرمجيات الضارة'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو البرنامج الذي يستخدم لاختبار اختراق الشبكات اللاسلكية؟',
    'options': ['Wireshark', 'Aircrack-ng', 'Nmap', 'Metasploit'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي المرحلة الأولى من مراحل الاختراق الأخلاقي؟',
    'options': ['الهجوم', 'جمع المعلومات', 'التنفيذ', 'التنظيف والتوثيق'],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو الأداة التي تستخدم لمسح الشبكات واكتشاف الأجهزة المتصلة؟',
    'options': ['Nmap', 'Wireshark', 'Burp Suite', 'John the Ripper'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من اختبار الاختراق؟',
    'options': [
      'تقييم أمن النظام واكتشاف الثغرات',
      'نشر البرمجيات الضارة',
      'تعطيل الأنظمة',
      'زيادة سرعة الشبكة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو نوع الاختبار الذي يتم فيه محاكاة هجوم من داخل الشركة؟',
    'options': [
      'الاختبار الأسود',
      'الاختبار الرمادي',
      'الاختبار الأبيض',
      'الاختبار الأزرق'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الأداة المستخدمة لاختبار اختراق تطبيقات الويب؟',
    'options': ['Nmap', 'Wireshark', 'Burp Suite', 'Hydra'],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو نوع الهجوم الذي يستغل ثغرات البرامج للحصول على صلاحيات غير مشروعة؟',
    'options': [
      'هجوم البرمجيات الضارة',
      'هجوم القوة الغاشمة',
      'هجوم الحقن',
      'هجوم الفيضانات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي الأداة التي تستخدم لفك كلمات المرور المشفرة؟',
    'options': ['Hydra', 'John the Ripper', 'Nmap', 'Burp Suite'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو البرنامج الذي يستخدم لتحليل حزم الشبكة؟',
    'options': ['Wireshark', 'Nmap', 'Metasploit', 'Burp Suite'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من الهندسة الاجتماعية في الاختراق؟',
    'options': [
      'تحسين تصميم المواقع',
      'خداع الأشخاص للحصول على معلوماتهم السرية',
      'تعلم البرمجة',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو النوع القانوني من المخترقين الذين يعملون على تحسين الأمان؟',
    'options': [
      'Black Hat Hacker',
      'Grey Hat Hacker',
      'White Hat Hacker',
      'Red Hat Hacker'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو البرنامج الذي يستخدم لاختبار اختراق أنظمة التشغيل؟',
    'options': ['Nmap', 'Metasploit', 'Wireshark', 'Hydra'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الأداة التي تستخدم لاكتشاف الثغرات في الأنظمة؟',
    'options': ['Nessus', 'Wireshark', 'Burp Suite', 'Hydra'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو نوع الهجوم الذي يستهدف قواعد البيانات بحقن أوامر SQL؟',
    'options': [
      'هجوم XSS',
      'هجوم DDoS',
      'هجوم SQL Injection',
      'هجوم الفيضانات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الهدف من اختبار الاختراق الأسود؟',
    'options': [
      'محاكاة هجوم حقيقي دون معرفة مسبقة بالنظام',
      'محاكاة هجوم من داخل الشركة',
      'تحليل بيانات الشبكة',
      'تعليم البرمجة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو البرنامج الذي يستخدم لاختبار اختراق الشبكات السلكية؟',
    'options': ['Nmap', 'Wireshark', 'Aircrack-ng', 'Metasploit'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو نوع الهجوم الذي يستخدم قوة الحوسبة لكسر كلمات المرور؟',
    'options': [
      'هجوم الفيضانات',
      'هجوم القوة الغاشمة',
      'هجوم البرمجيات الضارة',
      'هجوم الحقن'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي المرحلة الأخيرة من مراحل الاختراق الأخلاقي؟',
    'options': ['جمع المعلومات', 'الهجوم', 'التنفيذ', 'التنظيف والتوثيق'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الغرض من اختبار اختراق تطبيقات الويب؟',
    'options': [
      'تحسين تصميم المواقع',
      'اكتشاف الثغرات الأمنية في التطبيقات',
      'تعلم البرمجة',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو البرنامج الذي يستخدم لاختبار اختراق الشبكات الافتراضية؟',
    'options': ['Nmap', 'Wireshark', 'Metasploit', 'Aircrack-ng'],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو نوع الهجوم الذي يستغل ثغرات البرمجيات للحصول على صلاحيات غير مشروعة؟',
    'options': [
      'هجوم البرمجيات الضارة',
      'هجوم القوة الغاشمة',
      'هجوم الحقن',
      'هجوم الفيضانات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي الأداة التي تستخدم لاكتشاف الثغرات في تطبيقات الويب؟',
    'options': ['Nessus', 'Burp Suite', 'Wireshark', 'Hydra'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الغرض من اختبار اختراق الأنظمة؟',
    'options': [
      'تحسين تصميم المواقع',
      'اكتشاف الثغرات الأمنية في الأنظمة',
      'تعلم البرمجة',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو البرنامج الذي يستخدم لاختبار اختراق قواعد البيانات؟',
    'options': ['Nmap', 'Wireshark', 'Metasploit', 'SQLmap'],
    'correctOptionIndex': 3,
  },
  {
    'question':
        'ما هو نوع الهجوم الذي يستهدف تطبيقات الويب بحقن أكواد جافا سكريبت؟',
    'options': [
      'هجوم XSS',
      'هجوم DDoS',
      'هجوم SQL Injection',
      'هجوم الفيضانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من اختبار اختراق الشبكات؟',
    'options': [
      'تحسين تصميم المواقع',
      'اكتشاف الثغرات الأمنية في الشبكات',
      'تعلم البرمجة',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الأداة التي تستخدم لفحص الشبكات واكتشاف الثغرات؟',
    'options': ['Nmap', 'Wireshark', 'Burp Suite', 'Hydra'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو البرنامج الذي يستخدم لاختبار اختراق البريد الإلكتروني؟',
    'options': ['Nmap', 'Wireshark', 'Metasploit', 'Hydra'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو نوع الهجوم الذي يستهدف تطبيقات الويب بحقن أوامر SQL؟',
    'options': [
      'هجوم XSS',
      'هجوم DDoS',
      'هجوم SQL Injection',
      'هجوم الفيضانات'
    ],
    'correctOptionIndex': 2,
  },
];

const List<Map<String, dynamic>> FlutterQues = [
  {
    'question': 'ما هو الأمر المستخدم لطباعة النصوص في البرنامج؟',
    'options': ['main ', 'print', 'console', 'echo'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو Flutter؟ ',
    'options': [
      'نظام تشغيل',
      '  إطار عمل لتطوير تطبيقات الأجهزة المحمولة ',
      'أداة لتحرير الصور ',
      'لغة برمجة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': ' ما هي لغة البرمجة الأساسية المستخدمة في Flutter؟',
    'options': ['جافا', 'دارت  ', 'بايثون  ', 'سي '],
    'correctOptionIndex': 1,
  },
  {
    'question': '  ما هي الأداة المستخدمة لإنشاء واجهات المستخدم في Flutter؟ ',
    'options': ['Widgets  .', 'HTML .', 'XML  .', 'JSX  .'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة Hot Reload في Flutter؟',
    'options': [
      ' تشغيل التطبيق في الوضع الآمن ',
      ' تحديث الكود وعرض التغييرات فورًا دون إعادة تشغيل التطبيق',
      'إنشاء ملفات النسخ الاحتياطي',
      'إنشاء ملفات النسخ الاحتياطي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو Pubspec.yaml في مشروع Flutter؟',
    'options': [
      'ملف يحتوي على الصور والأيقونات ',
      'ملف يحتوي على تعريف المشروع وإعداداته  ',
      'ملف يحتوي على الأكواد المصدرية للتطبيق  ',
      'ملف يحتوي على البيانات المخزنة للتطبيق  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين StatefulWidget و StatelessWidget؟',
    'options': [
      'أ) StatefulWidget يمكن أن يتغير بمرور الوقت، بينما StatelessWidget ثابت  ',
      'ب) StatefulWidget يستخدم للواجهات البسيطة، بينما StatelessWidget للواجهات المعقدة  ',
      'ج) StatefulWidget يستخدم للواجهات الثابتة، بينما StatelessWidget للواجهات الديناميكية  ',
      '  د) StatefulWidget يستخدم للواجهات الكبيرة، بينما StatelessWidget للواجهات الصغيرة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': '  في فلاتر ما هو Scaffold؟  ',
    'options': [
      'أ) مكون يستخدم لعرض النصوص فقط ',
      'ب) مكون يستخدم لعرض الصور فقط   ',
      'ج) مكون يوفر بنية أساسية للواجهات، مثل شريط التطبيق والشريط الجانبي  ',
      'د) مكون يستخدم لتخزين البيانات  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو MaterialApp في Flutter؟',
    'options': [
      'أ) تطبيق يعتمد على تصميم المواد (Material Design)   ',
      'ب) تطبيق يعتمد على تصميم iOS ',
      'ج) تطبيق يعتمد على تصميم ويب  ',
      'د) تطبيق يعتمد على تصميم كلاسيكي '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة Text في Flutter؟',
    'options': [
      'أ) أداة لعرض الصور ',
      'ب) أداة لعرض النصوص ',
      'ج) أداة لإدخال النصوص   ',
      'د) أداة لإنشاء الرسوم المتحركة '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أداة Image في Flutter؟',
    'options': [
      'أ) أداة لعرض النصوص ',
      'ب) أداة لإدخال النصوص',
      'ج) أداة لعرض الصور  ',
      'د) أداة لإنشاء الرسوم المتحركة  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين Navigator.push و Navigator.pop؟',
    'options': [
      'ما هو الفرق بين Navigator.push و Navigator.pop؟  ',
      'ما هو الفرق بين Navigator.push و Navigator.pop؟ ',
      'ما هو الفرق بين Navigator.push و Navigator.pop؟   ',
      'ما هو الفرق بين Navigator.push و Navigator.pop؟  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين Padding و Margin في Flutter؟',
    'options': [
      'أ) Padding يضيف مساحة داخل حدود العنصر، بينما Margin يضيف مساحة خارج حدود العنصر ',
      'ب) Padding يضيف مساحة خارج حدود العنصر، بينما Margin يضيف مساحة داخل حدود العنصر  ',
      'ج) Padding يستخدم للنصوص فقط، بينما Margin يستخدم للصور فقط',
      'د) Padding يستخدم للصور فقط، بينما Margin يستخدم للنصوص فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question':
        'ب) Padding يضيف مساحة خارج حدود العنصر، بينما Margin يضيف مساحة داخل حدود العنصر',
    'options': [
      ' أ) تغيير حالة التطبيق بشكل دائم',
      'كيفية  ',
      'كيفية  ',
      'كيفية  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي وظيفة setState في StatefulWidget؟  ',
    'options': [
      'أ) تغيير حالة التطبيق بشكل دائم ',
      'ب) تحديث واجهة المستخدم عند تغيير حالة الكائن',
      'ج) حذف الكائن من الذاكرة ',
      'د) إنشاء نسخة احتياطية من الكائن  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو ListView في Flutter؟ ',
    'options': [
      'أ) أداة لعرض الصور    ',
      'ب) أداة لعرض النصوص  ',
      'ج) أداة لعرض قائمة من العناصر القابلة للتمرير   ',
      'د) أداة لإنشاء الرسوم المتحركة '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو الفرق بين mainAxisAlignment و crossAxisAlignment في Flutter؟',
    'options': [
      ' أ) mainAxisAlignment يحدد ترتيب العناصر على المحور الرئيسي، بينما crossAxisAlignment يحدد ترتيب العناصر على المحور العكسي  ',
      'ب) mainAxisAlignment يحدد ترتيب العناصر على المحور العكسي، بينما crossAxisAlignment يحدد ترتيب العناصر على المحور الرئيسي  ',
      'ج) mainAxisAlignment يستخدم للنصوص فقط، بينما crossAxisAlignment يستخدم للصور فقط',
      'د) mainAxisAlignment يستخدم للصور فقط، بينما crossAxisAlignment يستخدم للنصوص فقط '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': ' ما هو FutureBuilder في Flutter؟',
    'options': [
      'أ) أداة لعرض النصوص فقط',
      'ب) أداة لإنشاء الرسوم المتحركة',
      'ج) أداة لبناء واجهات مستخدم تعتمد على بيانات مستقبلية',
      'د) أداة لعرض الصور فقط'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين Column و Row في Flutter؟',
    'options': [
      'أ) Column يعرض العناصر أفقيًا، بينما Row يعرض العناصر عموديًا ',
      ' ب) Column يعرض العناصر عموديًا، بينما Row يعرض العناصر أفقيًا ',
      'ج) Column يعرض النصوص فقط، بينما Row يعرض الصور فقط ',
      'د) أداة لإنشاء الرسوم المتحركة '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين runApp و main في Flutter؟',
    'options': [
      'أ) runApp هو نقطة البداية لتطبيق Flutter، بينما main هو نقطة البداية لتطبيق Dart ',
      'ب) runApp يستخدم للنصوص فقط، بينما main يستخدم للصور فقط  ',
      ' ج) runApp يستخدم لتحميل الصور، بينما main يستخدم لتحميل النصوص ',
      'د) runApp يستخدم لإنشاء الرسوم المتحركة، بينما main يستخدم لتخزين البيانات '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو Drawer في Flutter؟ ',
    'options': [
      'أ) أداة لعرض النصوص ',
      'ب) أداة لإدخال النصوص  ',
      'ج) أداة لإنشاء قائمة جانبية قابلة للسحب',
      'د) أداة لعرض الصور'
    ],
    'correctOptionIndex': 1,
  },
];

const List<Map<String, dynamic>> WordPrsQues = [
  {
    'question': ' ما هو ووردبريس (WordPress)؟',
    'options': [
      ' لغة برمجة ',
      '  نظام تشغيل  ',
      'نظام إدارة محتوى (CMS)  ',
      'أداة لتحرير الصور  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي لغة البرمجة الأساسية المستخدمة في تطوير ووردبريس؟',
    'options': ['جافا', 'بايثون', ' PHP', 'روبي'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الامتداد الشائع لملفات قوالب ووردبريس؟',
    'options': ['html', 'php', 'css', 'js'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو ملف wp-config.php في ووردبريس؟',
    'options': [
      'ملف يحتوي على إعدادات القالب',
      'ملف يحتوي على إعدادات قاعدة البيانات',
      'ملف يحتوي على إعدادات المستخدم',
      'ملف يحتوي على إعدادات المكونات الإضافية'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو الفرق بين الصفحات (Pages) والمقالات (Posts) في ووردبريس؟',
    'options': [
      'الصفحات ثابتة وعادة ما تُستخدم للمحتوى الدائم، بينما المقالات تُستخدم للمحتوى الزمني والمتجدد  ',
      'الصفحات تُستخدم لعرض الصور، بينما المقالات تُستخدم لعرض النصوص',
      'الصفحات تُستخدم للمحتوى الزمني، بينما المقالات تُستخدم للمحتوى الثابت',
      'الصفحات تُستخدم للنصوص فقط، بينما المقالات تُستخدم للصور فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي المكونات الإضافية (Plugins) في ووردبريس؟',
    'options': [
      'أدوات لتحرير الصور ',
      'أدوات لإدارة المستخدمين  ',
      'برامج صغيرة تُضاف لتحسين وظائف الموقع  ',
      'أدوات لإنشاء الرسوم المتحركة  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو القالب (Theme) في ووردبريس؟ ',
    'options': [
      'مجموعة من الصور المخزنة  ',
      'مجموعة من الملفات تحدد تصميم الموقع  ',
      'مجموعة من النصوص البرمجية  ',
      'مجموعة من البيانات المخزنة  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو الفرق بين القالب الرئيسي (Parent Theme) والقالب الفرعي (Child Theme) في ووردبريس؟   ',
    'options': [
      'القالب الرئيسي هو القالب الأساسي، بينما القالب الفرعي يرث خصائصه ويتيح التعديل دون التأثير على القالب الرئيسي ',
      'القالب الرئيسي يُستخدم للنصوص، بينما القالب الفرعي يُستخدم للصور   ',
      'القالب الرئيسي يُستخدم لإدخال البيانات، بينما القالب الفرعي يُستخدم لعرض البيانات  ',
      'القالب الرئيسي يُستخدم لإنشاء الرسوم المتحركة، بينما القالب الفرعي يُستخدم لتخزين البيانات  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الويدجات (Widgets) في ووردبريس؟',
    'options': [
      ' أدوات لإدارة المستخدمين',
      'أدوات تُضاف إلى الشريط الجانبي أو مناطق الويدجات الأخرى لتحسين وظائف الموقع ',
      'أدوات لتحرير النصوص',
      'أدوات لإنشاء الرسوم المتحركة '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو الفرق بين الاستضافة المشتركة والاستضافة الخاصة بووردبريس؟',
    'options': [
      'الاستضافة المشتركة تتشارك مع مواقع أخرى في نفس الخادم، بينما الاستضافة الخاصة مخصصة لموقع واحد فقط ',
      'الاستضافة المشتركة تُستخدم للمواقع الصغيرة، بينما الاستضافة الخاصة تُستخدم للمواقع الكبيرة فقط ',
      'الاستضافة المشتركة تُستخدم للنصوص، بينما الاستضافة الخاصة تُستخدم للصور فقط   ',
      'الاستضافة المشتركة تُستخدم لإنشاء الرسوم المتحركة، بينما الاستضافة الخاصة تُستخدم لتخزين البيانات '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي وظيفة ملف .htaccess في ووردبريس؟',
    'options': [
      'يحتوي على إعدادات قاعدة البيانات',
      'يحتوي على إعدادات القالب',
      'يحتوي على إعدادات خادم الويب وإعادة كتابة الروابط  ',
      'يحتوي على إعدادات المكونات الإضافية  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو دور Yoast SEO في ووردبريس؟',
    'options': [
      ' أداة لتحرير الصور  ',
      'أداة لتحسين أداء الموقع',
      ' أداة لتحسين محركات البحث (SEO)',
      'أداة لإدارة المستخدمين  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو ووردبريس متعدد المواقع (WordPress Multisite)؟',
    'options': [
      ' نسخة من ووردبريس مخصصة لتحرير الصور ',
      'نسخة من ووردبريس تتيح إنشاء وإدارة عدة مواقع من تثبيت واحد  ',
      'نسخة من ووردبريس لتحسين محركات البحث  ',
      'نسخة من ووردبريس لإدارة المستخدمين  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي وظيفة ملف functions.php في ووردبريس؟',
    'options': [
      'يحتوي على إعدادات قاعدة البيانات',
      ' يحتوي على إعدادات المكونات الإضافية  ',
      'يحتوي على وظائف وإعدادات القالب  ',
      ' يحتوي على بيانات المستخدمين  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو الفرق بين الفئات (Categories) والكلمات المفتاحية (Tags) في ووردبريس؟',
    'options': [
      'الفئات تُستخدم لتنظيم المحتوى بشكل هرمي، بينما الكلمات المفتاحية تُستخدم لتنظيم المحتوى بشكل غير هرمي ',
      'الفئات تُستخدم للصور فقط، بينما الكلمات المفتاحية تُستخدم للنصوص فقط',
      'الفئات تُستخدم لإدخال النصوص، بينما الكلمات المفتاحية تُستخدم لعرض النصوص ',
      'الفئات تُستخدم لإنشاء الرسوم المتحركة، بينما الكلمات المفتاحية تُستخدم لتخزين البيانات  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو Elementor في ووردبريس؟',
    'options': [
      'أداة لبناء الصفحات',
      'أداة لتحرير الفيديو',
      'أداة لتحرير الصور',
      ' أداة لإدارة المستخدمين '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو WooCommerce في ووردبريس؟',
    'options': [
      'مكون إضافي لتحرير الصور   ',
      'مكون إضافي لإنشاء متجر إلكتروني  ',
      'مكون إضافي لتحسين محركات البحث   ',
      'مكون إضافي لإدارة المستخدمين '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الإضافات الأمنية الشهيرة في ووردبريس؟',
    'options': [' Yoast SEO', 'Akismet', 'Wordfence', 'WP Super Cache  '],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هي WP REST API في ووردبريس؟',
    'options': [
      'مجموعة من الأدوات لتحرير الصور ',
      'مجموعة من الأدوات لتحسين محركات البحث  ',
      'واجهة برمجة التطبيقات (API) للوصول إلى بيانات ووردبريس عبر HTTP ',
      'مجموعة من الأدوات لإدارة المستخدمين '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين النسخة المجانية والمدفوعة من ووردبريس؟',
    'options': [
      ' النسخة المجانية تحتوي على جميع الميزات، بينما النسخة المدفوعة لا تحتوي على جميع الميزات ',
      'النسخة المجانية تحتوي على ميزات محدودة، بينما النسخة المدفوعة تحتوي على ميزات إضافية ودعم فني  ',
      'النسخة المجانية تُستخدم لتحرير الصور، بينما النسخة المدفوعة تُستخدم لتحرير النصوص  ',
      ' النسخة المجانية تُستخدم لإدارة المستخدمين، بينما النسخة المدفوعة تُستخدم لتحسين محركات البحث '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو Custom Post Type في ووردبريس؟',
    'options': [
      'نوع مخصص من المقالات يمكن إنشاؤه لتلبية احتياجات محددة ',
      ' نوع مخصص من الصور يمكن إنشاؤه لتحرير الصور  ',
      'نوع مخصص من النصوص يمكن إنشاؤه لإدارة النصوص',
      ' نوع مخصص من البيانات يمكن إنشاؤه لتخزين البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي وظيفة WP_DEBUG في ووردبريس؟',
    'options': [
      ' لتحرير الصور  ',
      ' لتحسين محركات البحث  ',
      'لعرض أخطاء البرمجة في ووردبريس',
      'لإدارة المستخدمين  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين WordPress.org و WordPress.com؟',
    'options': [
      'WordPress.org هو نظام مستضاف، بينما WordPress.com هو نظام مفتوح المصدر ',
      ' WordPress.org هو نظام مفتوح المصدر لتحميل وتثبيت ووردبريس، بينما WordPress.com هو خدمة مستضافة تقدم مواقع جاهزة',
      ' WordPress.org يحتوي على أدوات لتحرير الصور، بينما WordPress.com يحتوي على أدوات لتحرير النصوص  ',
      'WordPress.org يحتوي على أدوات لتحسين محركات البحث، بينما WordPress.com يحتوي على أدوات '
    ],
    'correctOptionIndex': 1,
  },
];

const List<Map<String, dynamic>> BussinessQues = [
  {
    'question': 'ما هو تعريف إدارة الأعمال؟',
    'options': [
      'التخطيط والتنظيم والتحكم في الموارد لتحقيق الأهداف ',
      'البيع والشراء في السوق',
      'إدارة الأمور المالية فقط  ',
      'تنظيم الحفلات والفعاليات  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الوظائف الأساسية لإدارة الأعمال؟',
    'options': [
      ' التوظيف والتدريب فقط',
      'التسويق والمبيعات فقط',
      ' التخطيط والتنظيم والتوجيه والرقابة',
      ' الإنتاج والتصنيع فقط'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين القيادة والإدارة؟',
    'options': [
      'القيادة تركز على التخطيط والتنظيم، بينما الإدارة تركز على الإلهام والتوجيه',
      'القيادة تركز على الإلهام والتوجيه، بينما الإدارة تركز على التخطيط والتنظيم',
      'القيادة تركز على الأمور المالية، بينما الإدارة تركز على الإنتاج',
      ' لا يوجد فرق بينهما'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تحليل SWOT؟',
    'options': [
      ' تحليل نقاط القوة والضعف والفرص والتهديدات',
      ' تحليل السوق والمنافسين والعملاء والتكنولوجيا',
      'تحليل الأرباح والخسائر فقط',
      ' تحليل الإنتاج والتصنيع فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الإدارة الاستراتيجية؟',
    'options': [
      'إدارة المشاريع اليومية  ',
      'التخطيط الطويل الأجل لتحقيق الأهداف',
      'إدارة الشؤون المالية فقط',
      'إدارة الموارد البشرية فقط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي دورة حياة المنتج؟',
    'options': [
      'مراحل تقديم المنتج في السوق من التقديم إلى النمو والنضج والانحدار ',
      ' دورة الإنتاج والتصنيع فقط  ',
      'مراحل البحث والتطوير فقط  ',
      'دورة البيع والتوزيع فقط  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين السوق المستهدف والفئة المستهدفة؟',
    'options': [
      '  السوق المستهدف هو مجموعة محددة من العملاء، والفئة المستهدفة هي مجموعة كبيرة داخل السوق المستهدف',
      '   السوق المستهدف هو الشركة نفسها، والفئة المستهدفة هي العملاء',
      '  السوق المستهدف هو مجموعة كبيرة من العملاء، والفئة المستهدفة هي مجموعة محددة داخل السوق المستهدف',
      '  لا يوجد فرق بينهما'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي خطة العمل؟',
    'options': [
      'قائمة بالأعمال اليومية ',
      'جدول زمني للإنتاج',
      'قائمة بالموظفين',
      'وثيقة توضح الأهداف والإستراتيجيات والتكاليف والإيرادات المتوقعة للمشروع  '
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو مفهوم تحليل السوق؟',
    'options': [
      'تحديد تكلفة المنتجات',
      'حساب الأرباح والخسائر ',
      ' دراسة المنافسين والعملاء والاتجاهات السوقية لتحديد الفرص والتحديات',
      ' إدارة الموارد البشرية '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو التسويق بالعلاقات؟',
    'options': [
      ' البيع المباشر للمنتجات ',
      'التسويق عبر الإنترنت ',
      'بناء علاقات طويلة الأجل مع العملاء لتعزيز الولاء',
      'الإعلان عبر التلفزيون '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو التخطيط المالي؟',
    'options': [
      'تنظيم الاجتماعات ',
      'تقدير التكاليف والإيرادات ووضع ميزانية للمشروع',
      ' توظيف الموظفين',
      'تسويق المنتجات  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو التحليل المالي؟',
    'options': [
      'دراسة السوق  ',
      'إدارة الإنتاج ',
      'التخطيط الاستراتيجي',
      'تحليل البيانات المالية لتقييم الأداء المالي للشركة  '
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هي إدارة الموارد البشرية؟',
    'options': [
      'إدارة المخزون ',
      'إدارة التوظيف والتدريب وتقييم أداء الموظفين  ',
      'إدارة الشؤون المالية   ',
      'إدارة التسويق  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الابتكار في الأعمال؟',
    'options': [
      'تطوير أفكار ومنتجات جديدة لتحسين الأداء وتلبية احتياجات السوق',
      'تخفيض التكاليف  ',
      'زيادة الأرباح فقط  ',
      'تحسين الجودة فقط  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو مفهوم رضا العملاء؟ ',
    'options': [
      'زيادة المبيعات ',
      ' تحقيق توقعات العملاء واحتياجاتهم من خلال المنتجات والخدمات',
      'تقليل التكاليف ',
      'تحسين الإنتاجية  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو التوازن بين العمل والحياة؟',
    'options': [
      'تحقيق توازن بين متطلبات العمل والحياة الشخصية للموظفين',
      ' زيادة ساعات العمل ',
      ' تقليل الإجازات',
      ' تحسين الجودة '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو مفهوم العولمة في الأعمال؟',
    'options': [
      'تقليل التكاليف',
      'زيادة الإنتاج',
      ' تحسين الجودة',
      'توسع الشركات والنشاطات الاقتصادية عبر الحدود الوطنية '
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هي أنواع الاستراتيجيات التنافسية؟',
    'options': [
      'القيادة بالتكلفة، التمايز، والتركيز',
      'التسويق والإعلان',
      'التوظيف والتدريب',
      'لتخطيط المالي  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو مفهوم القيمة المضافة؟',
    'options': [
      'الأرباح فقط ',
      'التكاليف فقط  ',
      'القيمة التي تضاف إلى المنتج أو الخدمة في كل مرحلة من مراحل الإنتاج ',
      'الجودة فقط '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو نموذج الأعمال (Business Model)؟',
    'options': [
      'الخطة التي توضح كيف تحقق الشركة القيمة وتجني الإيرادات ',
      ' جدول الإنتاج  ',
      ' قائمة الموظفين  ',
      'خطة التسويق '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو التحليل المالي النسبي؟',
    'options': [
      ' تحليل السوق ',
      'تحليل الموارد البشرية  ',
      'استخدام النسب المالية لتقييم الأداء المالي للشركة',
      'تحليل الإنتاج'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو التخطيط التشغيلي؟',
    'options': [
      ' التخطيط الطويل الأجل  ',
      'التخطيط المالي فقط  ',
      'التخطيط للعمليات اليومية لتحقيق الأهداف قصيرة الأجل',
      'التخطيط للتوظيف فقط  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو دور العلاقات العامة في الأعمال؟',
    'options': [
      'بناء صورة إيجابية للشركة وتعزيز العلاقات مع الجمهور ',
      'زيادة الأرباح فقط',
      'تحسين الجودة فقط  ',
      'تقليل التكاليف فقط '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي إدارة سلسلة التوريد؟',
    'options': [
      'إدارة الموارد البشرية',
      'إدارة الإنتاج فقط',
      ' إدارة التسويق فقط  ',
      'إدارة تدفق البضائع والخدمات من الموردين إلى العملاء '
    ],
    'correctOptionIndex': 3,
  },
];

const List<Map<String, dynamic>> LeaderShipQues = [
  {
    'question': 'ما هو تعريف القيادة؟',
    'options': [
      'إدارة العمليات اليومية ',
      'التأثير على الآخرين لتحقيق الأهداف المشتركة',
      'تنظيم الموارد المالية  ',
      'توظيف وتدريب الموظفين  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الصفات الأساسية للقائد الناجح؟',
    'options': [
      'القوة البدنية والشجاعة',
      ' الذكاء العاطفي، الرؤية، والقدرة على التواصل',
      '  السرعة في اتخاذ القرارات',
      ' القدرة على التلاعب'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين القيادة والإدارة؟',
    'options': [
      'القيادة تركز على الإلهام والتوجيه، بينما الإدارة تركز على التخطيط والتنظيم',
      ' القيادة تركز على الأمور المالية، بينما الإدارة تركز على الإنتاج',
      'القيادة تتعلق بالقرارات اليومية، بينما الإدارة تتعلق بالرؤية المستقبلية',
      'لا يوجد فرق بينهما'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو نمط القيادة الأوتوقراطية؟',
    'options': [
      'القائد يشجع المشاركة في اتخاذ القرارات',
      ' القائد يعتمد على تفويض المهام',
      ' القائد يركز على تطوير العلاقات الشخصية',
      ' القائد يتخذ جميع القرارات دون استشارة الفريق'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو نمط القيادة الديمقراطية؟',
    'options': [
      'القائد يتخذ جميع القرارات دون استشارة الفريق  ',
      'القائد يعتمد على تفويض المهام',
      'القائد يشجع مشاركة الفريق في اتخاذ القرارات',
      ' القائد يركز على تنفيذ الأوامر بسرعة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو نمط القيادة التفويضية؟',
    'options': [
      ' القائد يتخذ جميع القرارات دون استشارة الفريق ',
      'القائد يشجع مشاركة الفريق في اتخاذ القرارات  ',
      ' القائد يعتمد على تفويض المهام للأعضاء  ',
      ' القائد يركز على تنفيذ الأوامر بسرعة  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو نمط القيادة التحويلية؟',
    'options': [
      'القائد يركز على الإشراف والمراقبة  ',
      'القائد يلهم الفريق ويشجعهم على تحقيق الأهداف الكبيرة  ',
      ' القائد يركز على الأمور المالية فقط  ',
      'القائد يتجاهل احتياجات الفريق  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي القيادة الموقفية؟',
    'options': [
      'اتباع نفس النمط في جميع المواقف ',
      'تجاهل المواقف المختلفة   ',
      'تغيير نمط القيادة بناءً على الموقف والظروف  ',
      ' الاعتماد على القوانين فقط  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو دور القائد في تطوير الفريق؟',
    'options': [
      ' تجاهل احتياجات الفريق',
      'التركيز فقط على الإنتاج ',
      'تحديد الأهداف وتوفير التدريب والدعم',
      'تقليل التكاليف فقط '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الذكاء العاطفي؟',
    'options': [
      ' القدرة على تحليل البيانات المالية ',
      'القدرة على فهم وإدارة العواطف الشخصية وعواطف الآخرين ',
      'القدرة على القيام بالعمليات الحسابية بسرعة   ',
      'القدرة على إدارة الوقت '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو دور القائد في حل النزاعات؟',
    'options': [
      ' تجاهل النزاعات ',
      'استخدام السلطة لفرض الحلول',
      ' التوسط بين الأطراف وتوجيههم نحو حلول بناءة  ',
      'زيادة النزاعات لتعزيز المنافسة  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي القيادة الأخلاقية؟',
    'options': [
      ' القيادة التي تعتمد على المبادئ والقيم الأخلاقية في اتخاذ القرارات  ',
      'القيادة التي تعتمد على تحقيق الأرباح بأي وسيلة ',
      'القيادة التي تعتمد على القوة والسيطرة',
      'القيادة التي تتجاهل احتياجات الفريق  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين القائد والمدير؟  ',
    'options': [
      'القائد يركز على الرؤية والإلهام، بينما المدير يركز على التخطيط والتنظيم ',
      ' القائد يتعامل مع الشؤون المالية فقط، بينما المدير يتعامل مع الإنتاج  ',
      'القائد يهتم بالأهداف اليومية، بينما المدير يهتم بالأهداف الطويلة الأجل  ',
      'لا يوجد فرق بينهما  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور القائد في تعزيز الابتكار؟',
    'options': [
      'تشجيع التفكير الإبداعي ودعم الأفكار الجديدة',
      ' رفض الأفكار الجديدة  ',
      'التركيز فقط على الإنتاج  ',
      ' تقليل التكاليف فقط  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو مفهوم القيادة الخدمية؟ ',
    'options': [
      ' القائد يستخدم الفريق لتحقيق أهدافه الشخصية ',
      'القائد يسعى لخدمة الفريق وتلبية احتياجاتهم',
      'القائد يركز فقط على تحقيق الأرباح ',
      ' القائد يتجاهل احتياجات الفريق  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي القيادة التبادلية؟',
    'options': [
      'القائد يعقد صفقات مع الفريق بناءً على الأداء والمكافآت',
      'القائد يتجاهل الأداء  ',
      ' القائد يعتمد على السلطة والقوة   ',
      'القائد يركز على تطوير العلاقات الشخصية '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور القائد في بناء الثقافة التنظيمية؟',
    'options': [
      'تجاهل الثقافة التنظيمية',
      ' تحديد القيم والمبادئ التي توجه سلوك الفريق',
      'التركيز فقط على الإنتاج',
      ' تقليل التكاليف فقط '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو مفهوم القيادة الذاتية؟',
    'options': [
      ' القائد يعتمد على نفسه فقط ولا يستشير الفريق',
      ' القائد يعتمد على التعليمات الصارمة',
      'القائد يتجاهل احتياجات الفريق',
      'القائد يشجع الأعضاء على قيادة أنفسهم وتحمل المسؤولية  '
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو دور القائد في تحفيز الفريق؟',
    'options': [
      'تقديم المكافآت والتقدير وتعزيز الشعور بالانتماء ',
      'تقليل الرواتب  ',
      'زيادة ساعات العمل ',
      'تجاهل جهود الفريق '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين القيادة الرسمية وغير الرسمية؟',
    'options': [
      ' القيادة الرسمية تعتمد على السلطة الممنوحة من المنظمة، بينما القيادة غير الرسمية تعتمد على النفوذ الشخصي ',
      'القيادة الرسمية تعتمد على النفوذ الشخصي، بينما القيادة غير الرسمية تعتمد على السلطة الممنوحة من المنظمة  ',
      'القيادة الرسمية تعتمد على التخطيط والتنظيم، بينما القيادة غير الرسمية تعتمد على الإلهام والتوجيه  ',
      ' لا يوجد فرق بينهما '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو دور القائد في اتخاذ القرارات؟',
    'options': [
      'اتخاذ القرارات بشكل فردي دون استشارة الفريق ',
      'تحليل المعلومات واستشارة الفريق واختيار أفضل الحلول',
      'تأجيل اتخاذ القرارات',
      'الاعتماد على الحظ في اتخاذ القرارات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو مفهوم القيادة بالمثال؟',
    'options': [
      'القائد يظهر السلوكيات والقيم التي يتوقعها من الفريق من خلال أفعاله الشخصية  ',
      ' القائد يعتمد على إصدار الأوامر فقط  ',
      ' القائد يتجاهل القيم والسلوكيات',
      'القائد يعتمد على العقوبات لتحفيز الفريق  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور القائد في تطوير القدرات الشخصية للفريق؟',
    'options': [
      'تقديم التدريب والتوجيه والفرص للتعلم والنمو ',
      'تقليل الفرص للتعلم',
      'التركيز فقط على الإنتاج  ',
      'تجاهل تطور الفريق '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو مفهوم القيادة بالرؤية؟',
    'options': [
      'القائد يعتمد على التعليمات الصارمة',
      'القائد يركز فقط على الأهداف القصيرة الأجل',
      'القائد يحدد رؤية مستقبلية ملهمة ويوجه الفريق لتحقيقها',
      'القائد يتجاهل التخطيط للمستقبل '
    ],
    'correctOptionIndex': 2,
  },
];

const List<Map<String, dynamic>> HrQues = [
  {
    'question': 'ما هو تعريف إدارة الموارد البشرية؟',
    'options': [
      'إدارة العمليات اليومية للشركة ',
      'تخطيط وتنظيم وتوجيه ورقابة استخدام الموارد البشرية لتحقيق أهداف المنظمة',
      ' تنظيم الموارد المالية للشركة  ',
      'توظيف وتدريب الموظفين فقط  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': ' ما هي وظيفة إدارة الموارد البشرية في عملية التوظيف؟',
    'options': [
      ' تحديد الأهداف المالية',
      ' إدارة الموارد التكنولوجية',
      'تخطيط وتنفيذ استراتيجيات التوظيف واختيار الموظفين',
      'إعداد التقارير المالية'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي وظيفة إدارة الأداء في الموارد البشرية؟',
    'options': [
      'إدارة البيانات المالية',
      'تقييم أداء الموظفين وتحسينه',
      'تنظيم الاجتماعات اليومية',
      'تطوير المنتجات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي استراتيجية الاحتفاظ بالموظفين؟',
    'options': [
      ' تقديم الرواتب المنخفضة',
      'زيادة ساعات العمل',
      'تحسين بيئة العمل وتقديم حوافز وتطوير مهني',
      'تقليل الفرص التدريبية'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي فوائد التدريب والتطوير في الموارد البشرية؟',
    'options': [
      ' تقليل تكاليف الشركة ',
      'زيادة إنتاجية الموظفين وتحسين مهاراتهم',
      ' تقليل عدد الموظفين',
      'تحسين العلاقات مع العملاء'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تعريف تحليل الوظائف؟',
    'options': [
      'تحديد الأهداف المالية للشركة ',
      'تنظيم الاجتماعات اليومية  ',
      ' تطوير المنتجات الجديدة  ',
      'جمع وتحليل المعلومات حول الوظائف لتحديد متطلبات العمل  '
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': ' ما هي وظيفة تقييم الأداء؟',
    'options': [
      'تحديد الرواتب فقط  ',
      'تطوير المنتجات الجديدة  ',
      'قياس أداء الموظفين وتقديم الملاحظات لتحسينه  ',
      'تنظيم الموارد التكنولوجية  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي أهمية إدارة الوقت في الموارد البشرية؟',
    'options': [
      'تقليل التكاليف المالية ',
      'تنظيم الاجتماعات اليومية   ',
      'زيادة إنتاجية الموظفين وتحقيق الأهداف في الوقت المحدد  ',
      'تطوير المنتجات الجديدة  '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي سياسة الباب المفتوح في إدارة الموارد البشرية؟',
    'options': [
      'توفير فرص للتدريب',
      'تشجيع الموظفين على التعبير عن مشكلاتهم واقتراحاتهم بحرية ',
      'تحديد الرواتب فقط',
      'زيادة ساعات العمل '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو مفهوم التعويضات والمزايا؟',
    'options': [
      ' تقديم الرواتب فقط',
      ' تنظيم الاجتماعات اليومية ',
      'تقديم حزمة من الرواتب والمزايا الأخرى مثل التأمين الصحي والإجازات',
      'تقليل التكاليف المالية '
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي أهمية دراسة رضى الموظفين؟',
    'options': [
      ' تقليل عدد الموظفين ',
      'تحسين بيئة العمل وزيادة الإنتاجية',
      'تطوير المنتجات الجديدة  ',
      ' تنظيم الموارد التكنولوجية  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو مفهوم الثقافة التنظيمية؟',
    'options': [
      'تنظيم الاجتماعات اليومية  ',
      'القيم والمعتقدات والسلوكيات التي تميز منظمة معينة',
      ' تحديد الرواتب فقط',
      ' تطوير المنتجات الجديدة  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو دور الموارد البشرية في إدارة التغيير؟',
    'options': [
      'مقاومة التغيير ',
      ' قيادة التغيير وتقديم الدعم للموظفين خلال فترات التغيير  ',
      'تقليل الفرص التدريبية  ',
      ' زيادة التكاليف المالية  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين التدريب والتطوير؟',
    'options': [
      'التدريب يركز على تحسين المهارات الحالية، بينما التطوير يركز على إعداد الموظفين للمستقبل',
      'التدريب يركز على إعداد الموظفين للمستقبل، بينما التطوير يركز على تحسين المهارات الحالية  ',
      'التدريب يركز على الجوانب المالية، بينما التطوير يركز على الجوانب الإدارية  ',
      'لا يوجد فرق بينهما  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي وظيفة تخطيط القوى العاملة؟',
    'options': [
      'تطوير المنتجات الجديدة ',
      ' تحديد عدد ونوع الموظفين المطلوبين لتحقيق الأهداف التنظيمية',
      ' تنظيم الاجتماعات اليومية ',
      'تحديد الرواتب فقط  '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو دور إدارة الموارد البشرية في الصحة والسلامة المهنية؟ ',
    'options': [
      'تطوير سياسات وإجراءات لضمان بيئة عمل آمنة وصحية',
      ' زيادة ساعات العمل  ',
      'تقليل الرواتب',
      ' تنظيم الموارد التكنولوجية '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو مفهوم إدارة الأداء؟',
    'options': [
      ' تحديد الأهداف المالية',
      ' تقييم وتحسين أداء الموظفين لتحقيق الأهداف التنظيمية  ',
      'تنظيم الاجتماعات اليومية',
      ' تطوير المنتجات الجديدة '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي فوائد تعزيز التنوع والشمول في مكان العمل؟',
    'options': [
      'تقليل التكاليف المالية',
      ' تقليل الفرص التدريبية',
      'زيادة ساعات العمل',
      'زيادة الإبداع والابتكار وتحسين سمعة الشركة  '
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو دور الموارد البشرية في إدارة النزاعات؟',
    'options': [
      ' التوسط بين الأطراف وتوجيههم نحو حلول بناءة ',
      'تجاهل النزاعات  ',
      'زيادة النزاعات لتعزيز المنافسة ',
      'استخدام القوة لفرض الحلول '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين الرواتب والمزايا؟',
    'options': [
      ' الرواتب تشمل التعويضات غير النقدية، بينما المزايا تشمل الأجر النقدي فقط ',
      ' الرواتب تشمل الأجر النقدي فقط، بينما المزايا تشمل التعويضات غير النقدية مثل التأمين والإجازات  ',
      ' لا يوجد فرق بينهما  ',
      ' الرواتب تشمل الأجر الشهري، بينما المزايا تشمل الأجر السنوي '
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أهمية تحليل الوظائف في الموارد البشرية؟',
    'options': [
      ' تحديد الأهداف المالية ',
      'فهم متطلبات الوظائف وتحديد المهارات اللازمة لشغلها  ',
      'تنظيم الاجتماعات اليومية',
      'تطوير المنتجات الجديدة'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو مفهوم إدارة المواهب؟',
    'options': [
      'جذب وتطوير والاحتفاظ بالموظفين الموهوبين  ',
      ' تنظيم الموارد التكنولوجية  ',
      ' تقليل التكاليف المالية',
      ' زيادة ساعات العمل  '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي فوائد التقييم الدوري للأداء؟',
    'options': [
      'تحسين أداء الموظفين وتقديم الملاحظات البناءة ',
      ' تقليل الفرص التدريبية',
      ' زيادة التكاليف المالية  ',
      ' تحديد الرواتب فقط '
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور الموارد البشرية في التخطيط الاستراتيجي؟',
    'options': [
      ' تطوير المنتجات الجديدة   ',
      'تنظيم الاجتماعات اليومية   ',
      ' تحديد الأهداف المالية فقط   ',
      'تحديد الاحتياجات المستقبلية للموارد البشرية وتحقيق التوازن بين العرض والطلب '
    ],
    'correctOptionIndex': 3,
  },
];

const List<Map<String, dynamic>> ContentWritingQues = [
  {
    'question': 'ما هو الغرض الأساسي من كتابة المحتوى؟',
    'options': [
      'التسلية',
      'الترويج للمنتجات والخدمات',
      'الكتابة لزيادة المشاهدات فقط',
      'تحقيق الشهرة الشخصية'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي إحدى المهارات الأساسية لكاتب المحتوى؟',
    'options': [
      'مهارات البرمجة',
      'مهارات التصميم',
      'مهارات البحث والتحليل',
      'مهارات القيادة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين المحتوى القصير والمحتوى الطويل؟',
    'options': [
      'المحتوى القصير يحتوي على معلومات أقل من المحتوى الطويل',
      'المحتوى الطويل يحتوي على معلومات أقل من المحتوى القصير',
      'المحتوى القصير يعتمد على الصور فقط',
      'المحتوى الطويل يعتمد على الفيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أفضل طريقة لجذب انتباه القارئ في بداية المقال؟',
    'options': [
      'كتابة مقدمة طويلة ومعقدة',
      'استخدام عنوان جذاب وملفت',
      'البدء بعرض إعلانات',
      'كتابة نص طويل دون فقرات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو المقصود بالكلمات المفتاحية في كتابة المحتوى؟',
    'options': [
      'الكلمات التي تجذب الانتباه فقط',
      'الكلمات التي تساعد في تحسين محركات البحث',
      'الكلمات التي تستخدم في الإعلانات فقط',
      'الكلمات التي تكتب بخط كبير فقط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أهمية استخدام الصور والفيديوهات في المحتوى؟',
    'options': [
      'تزيد من جاذبية المقال وتوضيح المعلومات',
      'تقلل من جودة المحتوى',
      'تزيد من حجم الصفحة',
      'تقلل من سرعة تحميل الصفحة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من كتابة العناوين الفرعية؟',
    'options': [
      'تحسين ترتيب المقال في محركات البحث',
      'زيادة عدد الكلمات',
      'جعل النص صعب القراءة',
      'تقليل عدد الفقرات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين المقالة الإخبارية والمقالة الترويجية؟',
    'options': [
      'المقالة الإخبارية تهدف لنقل الأخبار، بينما المقالة الترويجية تهدف للتسويق',
      'المقالة الإخبارية تهدف للتسويق، بينما المقالة الترويجية تهدف لنقل الأخبار',
      'المقالة الإخبارية تحتوي على صور فقط',
      'المقالة الترويجية تحتوي على فيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الفقرة الختامية في المقال؟',
    'options': [
      'فقرة تشرح الهدف من المقال',
      'فقرة تدعو القارئ لاتخاذ إجراء معين',
      'فقرة تحتوي على إعلانات',
      'فقرة تحتوي على صور وفيديوهات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو المقصود بالتحرير اللغوي للمحتوى؟',
    'options': [
      'إضافة صور وفيديوهات',
      'مراجعة النص للتأكد من صحته النحوية والإملائية',
      'كتابة محتوى جديد',
      'إضافة إعلانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أفضل طريقة لاستخدام الكلمات المفتاحية في المحتوى؟',
    'options': [
      'استخدامها بكثرة في كل جملة',
      'استخدامها بشكل طبيعي في النص',
      'استخدامها في العناوين فقط',
      'عدم استخدامها أبداً'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين المحتوى التفاعلي والمحتوى النصي؟',
    'options': [
      'المحتوى التفاعلي يشمل عناصر تفاعلية مثل الاستطلاعات والاختبارات',
      'المحتوى النصي يشمل عناصر تفاعلية مثل الاستطلاعات والاختبارات',
      'المحتوى التفاعلي يعتمد على النص فقط',
      'المحتوى النصي يعتمد على الصور فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي وظيفة الروابط الداخلية في المحتوى؟',
    'options': [
      'تحسين ترتيب المقال في محركات البحث وتوجيه القارئ لمقالات أخرى',
      'زيادة عدد الكلمات',
      'جعل النص صعب القراءة',
      'تقليل عدد الفقرات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور وسائل التواصل الاجتماعي في نشر المحتوى؟',
    'options': [
      'زيادة الانتشار والوصول إلى جمهور أوسع',
      'تقليل جودة المحتوى',
      'زيادة عدد الكلمات',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين المقالة والمدونة؟',
    'options': [
      'المقالة تكتب للنشر في الصحف والمجلات، بينما المدونة تكتب للنشر على الإنترنت',
      'المقالة تكتب للنشر على الإنترنت، بينما المدونة تكتب للنشر في الصحف والمجلات',
      'المقالة تحتوي على فيديوهات فقط',
      'المدونة تحتوي على صور فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو المقصود بالمحتوى المتجدد؟',
    'options': [
      'المحتوى الذي يتم تحديثه بانتظام ليظل حديثاً',
      'المحتوى الذي يتم كتابته مرة واحدة فقط',
      'المحتوى الذي يحتوي على فيديوهات فقط',
      'المحتوى الذي يحتوي على صور فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين الكتابة الفنية وكتابة المحتوى؟',
    'options': [
      'الكتابة الفنية تركز على الشروحات التقنية، بينما كتابة المحتوى تركز على التسويق والترويج',
      'كتابة المحتوى تركز على الشروحات التقنية، بينما الكتابة الفنية تركز على التسويق والترويج',
      'الكتابة الفنية تحتوي على صور فقط',
      'كتابة المحتوى تحتوي على فيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من تحليل الجمهور المستهدف؟',
    'options': [
      'فهم احتياجات وتفضيلات الجمهور لتقديم محتوى ملائم',
      'زيادة عدد الكلمات',
      'تقليل جودة المحتوى',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين العنوان الرئيسي والعنوان الفرعي؟',
    'options': [
      'العنوان الرئيسي هو العنوان الأساسي للمقال، بينما العنوان الفرعي هو عنوان فقرة معينة',
      'العنوان الفرعي هو العنوان الأساسي للمقال، بينما العنوان الرئيسي هو عنوان فقرة معينة',
      'العنوان الرئيسي يحتوي على صور فقط',
      'العنوان الفرعي يحتوي على فيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أهمية استخدام لغة بسيطة وواضحة في كتابة المحتوى؟',
    'options': [
      'تسهيل فهم القارئ للمحتوى وجذب انتباهه',
      'زيادة عدد الكلمات',
      'تقليل جودة المحتوى',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين التحرير اللغوي والتحرير التحريري؟',
    'options': [
      'التحرير اللغوي يركز على التصحيح النحوي والإملائي، بينما التحرير التحريري يركز على تحسين بنية المحتوى وتدفقه',
      'التحرير التحريري يركز على التصحيح النحوي والإملائي، بينما التحرير اللغوي يركز على تحسين بنية المحتوى وتدفقه',
      'التحرير اللغوي يحتوي على صور فقط',
      'التحرير التحريري يحتوي على فيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أهمية تقديم محتوى ذو قيمة للقارئ؟',
    'options': [
      'زيادة ولاء القارئ وزيادة معدلات الزيارة',
      'زيادة عدد الكلمات',
      'تقليل جودة المحتوى',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين كتابة المقالة وكتابة الإعلانات؟',
    'options': [
      'كتابة المقالة تهدف لتقديم معلومات مفصلة، بينما كتابة الإعلانات تهدف لجذب الانتباه وتشجيع الشراء',
      'كتابة الإعلانات تهدف لتقديم معلومات مفصلة، بينما كتابة المقالة تهدف لجذب الانتباه وتشجيع الشراء',
      'كتابة المقالة تحتوي على صور فقط',
      'كتابة الإعلانات تحتوي على فيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أفضل طريقة لتحسين محركات البحث (SEO) للمحتوى؟',
    'options': [
      'استخدام الكلمات المفتاحية بشكل طبيعي وكتابة محتوى ذو قيمة',
      'زيادة عدد الكلمات',
      'استخدام الكلمات المفتاحية بكثرة',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين المحتوى التعليمي والمحتوى الترفيهي؟',
    'options': [
      'المحتوى التعليمي يهدف لتقديم معلومات مفيدة، بينما المحتوى الترفيهي يهدف للتسلية',
      'المحتوى الترفيهي يهدف لتقديم معلومات مفيدة، بينما المحتوى التعليمي يهدف للتسلية',
      'المحتوى التعليمي يحتوي على صور فقط',
      'المحتوى الترفيهي يحتوي على فيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام الإحصاءات والبيانات في المحتوى؟',
    'options': [
      'تعزيز مصداقية المحتوى وتقديم معلومات دقيقة',
      'زيادة عدد الكلمات',
      'تقليل جودة المحتوى',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أهمية استخدام الأسئلة في كتابة المحتوى؟',
    'options': [
      'جذب انتباه القارئ وتحفيزه على التفكير والتفاعل',
      'زيادة عدد الكلمات',
      'تقليل جودة المحتوى',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين المحتوى الأصلي والمحتوى المنسوخ؟',
    'options': [
      'المحتوى الأصلي يكتب لأول مرة، بينما المحتوى المنسوخ ينقل من مصادر أخرى',
      'المحتوى المنسوخ يكتب لأول مرة، بينما المحتوى الأصلي ينقل من مصادر أخرى',
      'المحتوى الأصلي يحتوي على صور فقط',
      'المحتوى المنسوخ يحتوي على فيديوهات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من استخدام الروابط الخارجية في المحتوى؟',
    'options': [
      'تعزيز مصداقية المحتوى وتوجيه القارئ لمصادر موثوقة',
      'زيادة عدد الكلمات',
      'تقليل جودة المحتوى',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أهمية كتابة محتوى متجدد؟',
    'options': [
      'زيادة التفاعل والاهتمام من الجمهور بمرور الوقت',
      'زيادة عدد الكلمات',
      'تقليل جودة المحتوى',
      'جعل النص صعب القراءة'
    ],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> CustomerServicesQues = [
  {
    'question': 'ما هو الهدف الرئيسي لهذه الدورة؟',
    'options': [
      'تعلم البرمجة',
      'حماية البيانات من الاختراقات السيئة',
      'تعلم التصميم الجرافيكي',
      'تعلم التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو النظام المستخدم في الدورة؟',
    'options': ['Windows', 'MacOS', 'Kali Linux', 'Ubuntu'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو البرنامج المستخدم لتثبيت Kali Linux؟',
    'options': ['VirtualBox', 'Vmware', 'Parallels', 'Hyper-V'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي التقنية المستخدمة لرؤية جميع الأجهزة المتصلة بـKali؟',
    'options': ['NMAP', 'Wireshark', 'Netstat', 'Tcpdump'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من تعلم الهندسة الاجتماعية في هذه الدورة؟',
    'options': [
      'تحسين تصميم المواقع',
      'فهم كيفية خداع الأشخاص للحصول على معلوماتهم',
      'تعلم البرمجة بلغة Python',
      'فهم كيفية إنشاء قواعد بيانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من هذه المحاضرة؟',
    'options': [
      'تعليم البرمجة',
      'تعريف بالاختراق الأخلاقي',
      'تعلم التصميم الجرافيكي',
      'تعلم التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نوع المخترق الذي يستخدم مهاراته لأهداف غير قانونية؟',
    'options': [
      'White Hat Hacker',
      'Grey Hat Hacker',
      'Black Hat Hacker',
      'Red Hat Hacker'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ماذا يفعل المخترق الأخلاقي؟',
    'options': [
      'يسرق البيانات',
      'يخترق الأنظمة لتحقيق الربح',
      'يحمي الأنظمة والشبكات',
      'يكتب برامج ضارة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما الذي يجب عليك فعله إذا أردت مشاهدة المزيد من الفيديوهات؟',
    'options': [
      'عدم الاشتراك في القناة',
      'عدم التعليق',
      'الإعجاب، التعليق، والاشتراك',
      'إلغاء الاشتراك'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي أحدى الأهداف الرئيسية للاختراق الأخلاقي؟',
    'options': [
      'سرقة البيانات',
      'تعطيل الأنظمة',
      'التعرف على الثغرات وإصلاحها',
      'نشر الفيروسات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الموضوع الرئيسي لهذا الفيديو؟',
    'options': [
      'تعلم البرمجة',
      'عرض تطبيق جديد لـ GABT',
      'تعلم التصميم الجرافيكي',
      'تعلم التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما الذي سيتم عرضه في هذا الفيديو؟',
    'options': [
      'كيفية كتابة الكود',
      'كيفية استخدام GABT لتوليد التطبيقات',
      'كيفية تصميم مواقع الويب',
      'كيفية تحرير الصور'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو GABT؟',
    'options': [
      'لغة برمجة',
      'أداة لتوليد التطبيقات',
      'برنامج لتحرير الفيديو',
      'منصة للتواصل الاجتماعي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ماذا سيتم استعراضه في الفيديو؟',
    'options': [
      'أمثلة عن تطبيقات GABT',
      'كيفية كتابة المقالات',
      'كيفية تصميم الشعارات',
      'كيفية تحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي بداية تطبيق GABT في الفيديو؟',
    'options': [
      'تعلم الأساسيات',
      'كيفية توليد تطبيق باستخدام GABT',
      'تعلم البرمجة',
      'تعلم التصميم الجرافيكي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الرسالة الرئيسية في هذا الفيديو؟',
    'options': [
      'شكر المشاهدين على مساعدتهم ودعمهم',
      'تقديم لعبة جديدة',
      'شرح كيفية استخدام الكمبيوتر',
      'تعليم البرمجة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ماذا سيحدث في الفيديو القادم؟',
    'options': [
      'شرح كيفية استخدام الكمبيوتر',
      'تقديم لعبة جديدة',
      'شكر المشاهدين على مساعدتهم',
      'تعليم البرمجة'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما الذي يشكر روبرت المشاهدين عليه؟',
    'options': ['دعمهم', 'مساعدتهم', 'تعليقاتهم', 'جميع ما سبق'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما الذي سيبدأ به روبرت في الفيديو الحالي؟',
    'options': [
      'استخدام الكمبيوتر',
      'تقديم لعبة جديدة',
      'شكر المشاهدين',
      'تعليم البرمجة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو النشاط الرئيسي الذي سيتم عرضه في الفيديو؟',
    'options': [
      'استخدام الكمبيوتر',
      'تقديم لعبة جديدة',
      'شرح كيفية البرمجة',
      'شكر المشاهدين'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'من هو المتحدث الرئيسي في الفيديو؟',
    'options': ['روبرت كونشير', 'عبد النزام قشري', 'طرفين', 'الوزير'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو موضوع الفيديو الذي يقدمه طرفين؟',
    'options': [
      'كيفية صنع الفيديو',
      'شرح نظام لينكس',
      'الحديث عن إرث عروس هايكين',
      'الحرب العالمية المقبلة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما الذي يشكر عبد النزام قشري الجمهور عليه؟',
    'options': [
      'دعمهم وحبهم',
      'مساعدتهم في صنع الفيديو',
      'تعليقاتهم على الفيديو',
      'متابعتهم للقناة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الرابط المرفق في الوصف؟',
    'options': [
      'لمعرفة المزيد عن لينكس',
      'للتسجيل في دورة تعليمية',
      'لمشاهدة المزيد من الفيديوهات',
      'لشراء منتجات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'لماذا يريد المتحدثون صنع سور للحرب؟',
    'options': [
      'لتعزيز الأمان',
      'لتعزيز الحرب الحمراء',
      'لمواجهة الحرب العالمية المقبلة',
      'كل ما سبق'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الموضوع الرئيسي للفيديو؟',
    'options': [
      'كيفية تنزيل كالي لينكس واستخدامه على VMware',
      'كيفية تحميل نظام لينكس العادي',
      'كيفية تثبيت ويندوز على جهاز الكمبيوتر',
      'كيفية تشغيل الأفلام باستخدام برنامج OPERA'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الخطوة الأولى لتنزيل كالي لينكس؟',
    'options': [
      'فتح مدير المهام',
      'البحث عن كالي لينكس على OPERA',
      'تحميل برنامج VMware',
      'البحث عن كلمة الافتراضية'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي الخطوة الأخيرة قبل تشغيل كالي لينكس على VMware؟',
    'options': [
      'تنزيل كالي لينكس',
      'التأكد من تفعيل خاصية الافتراضية',
      'تحميل VMware',
      'إدخال اسم المستخدم وكلمة المرور'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو اسم المستخدم الافتراضي لكالي لينكس؟',
    'options': ['Admin', 'User', 'Kali', 'Root'],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو الحجم الموصى به للذاكرة العشوائية (RAM) لتشغيل كالي لينكس؟',
    'options': ['1 جيجابايت', '2 جيجابايت', '4 جيجابايت', '8 جيجابايت'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الأمر المستخدم لمعرفة الدليل الحالي؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'كيف يمكنك فتح الطرفية باستخدام اختصار لوحة المفاتيح؟',
    'options': ['Ctrl + Alt + T', 'Ctrl + Shift + T', 'Alt + T', 'Shift + T'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لعرض الملفات والمجلدات في الدليل الحالي؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الأمر المستخدم لتغيير الدليل الحالي؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الأمر المستخدم لإنشاء مجلد جديد؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الأمر المستخدم لنسخ الملفات من مكان إلى آخر؟',
    'options': ['mv', 'cp', 'cd', 'cat'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'كيف يمكنك العودة إلى المجلد السابق في الطرفية؟',
    'options': ['cd ..', 'cp', 'mv', 'clear'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لنقل الملفات من مكان إلى آخر؟',
    'options': ['mv', 'cp', 'cd', 'echo'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لمسح الشاشة في الطرفية؟',
    'options': ['clear', 'cat', 'echo', 'cd'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لكتابة نص داخل ملف؟',
    'options': ['mv', 'cp', 'echo', 'cat'],
    'correctOptionIndex': 2,
  },
];

const List<Map<String, dynamic>> MarketingQues = [
  {
    'question': 'ما هو الهدف الرئيسي للتسويق؟',
    'options': [
      'زيادة الوعي بالعلامة التجارية وجذب العملاء المحتملين',
      'زيادة الإنتاج',
      'تقليل التكاليف',
      'زيادة عدد الموظفين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question':
        'ما هي الاستراتيجية التي تهدف إلى استهداف فئة معينة من العملاء؟',
    'options': [
      'التسويق الجماعي',
      'التسويق المستهدف',
      'التسويق العشوائي',
      'التسويق الداخلي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو التسويق الرقمي؟',
    'options': [
      'التسويق عبر الصحف',
      'التسويق عبر الإنترنت والقنوات الرقمية',
      'التسويق عبر البريد التقليدي',
      'التسويق عبر الإذاعة'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي المكونات الأساسية للمزيج التسويقي؟',
    'options': [
      'المنتج، السعر، المكان، الترويج',
      'المنتج، السعر، الجودة، الإعلان',
      'الجودة، السعر، الترويج، التوزيع',
      'التوزيع، الجودة، المكان، المنتج'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالعلاقات؟',
    'options': [
      'بناء علاقات طويلة الأمد مع العملاء',
      'بيع المنتجات بشكل فردي',
      'الترويج عبر الإعلانات التلفزيونية',
      'استخدام العلاقات الشخصية في الترويج'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الأداة التي تستخدم لقياس رضا العملاء؟',
    'options': [
      'الاستبيانات واستطلاعات الرأي',
      'الإعلانات',
      'التحليلات المالية',
      'المقابلات الشخصية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق عبر المحتوى؟',
    'options': [
      'إنشاء وتوزيع محتوى ذو قيمة لجذب الجمهور',
      'نشر الإعلانات على التلفزيون',
      'إرسال رسائل بريدية مباشرة',
      'إقامة معارض تجارية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التحليل الرباعي (SWOT)؟',
    'options': [
      'تحليل القوى والضعف والفرص والتهديدات',
      'تحليل السوق والتكاليف',
      'تحليل الجودة والكمية',
      'تحليل الإعلانات والعروض الترويجية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق المؤثر؟',
    'options': [
      'استخدام شخصيات مشهورة للترويج للمنتجات',
      'إقامة عروض تجارية',
      'نشر إعلانات في الصحف',
      'استخدام اللافتات الإعلانية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق الشخصي؟',
    'options': [
      'بيع المنتجات مباشرة للعملاء وجهًا لوجه',
      'إرسال رسائل بريدية',
      'الترويج عبر الإنترنت',
      'التسويق عبر الهاتف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الدور الرئيسي للعلامة التجارية؟',
    'options': [
      'تمييز المنتج عن المنتجات المنافسة وبناء الثقة مع العملاء',
      'زيادة التكاليف',
      'تقليل المبيعات',
      'زيادة عدد الموظفين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي استراتيجية التسويق بالعروض الترويجية؟',
    'options': [
      'تقديم خصومات وعروض لجذب العملاء',
      'زيادة الأسعار',
      'تقليل الجودة',
      'زيادة عدد الموظفين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق الاجتماعي؟',
    'options': [
      'استخدام وسائل التواصل الاجتماعي للترويج للمنتجات',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في المجلات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق الداخلي؟',
    'options': [
      'جذب العملاء عبر توفير محتوى ذو قيمة',
      'نشر الإعلانات في الصحف',
      'إقامة عروض تجارية',
      'بيع المنتجات مباشرة للعملاء'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالعمولة؟',
    'options': [
      'تقديم مكافآت للأفراد الذين يروجون للمنتجات',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في المجلات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالخدمات؟',
    'options': [
      'تقديم خدمات إضافية للعملاء',
      'بيع المنتجات فقط',
      'نشر الإعلانات في الصحف',
      'إقامة عروض تجارية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق التجريبي؟',
    'options': [
      'تقديم تجربة مباشرة للعملاء مع المنتجات',
      'نشر الإعلانات في المجلات',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التحليل البيئي في التسويق؟',
    'options': [
      'تحليل العوامل الخارجية التي تؤثر على السوق',
      'تحليل التكاليف',
      'تحليل الجودة',
      'تحليل المبيعات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق الجماعي؟',
    'options': [
      'استهداف مجموعة كبيرة من العملاء',
      'استهداف فئة محددة من العملاء',
      'بيع المنتجات عبر الهاتف',
      'نشر الإعلانات في الصحف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الدور الرئيسي للإعلانات؟',
    'options': [
      'زيادة الوعي بالمنتجات والخدمات وجذب العملاء',
      'زيادة التكاليف',
      'تقليل المبيعات',
      'زيادة عدد الموظفين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي استراتيجية التسويق بالمحتوى؟',
    'options': [
      'إنشاء وتوزيع محتوى ذو قيمة لجذب الجمهور',
      'نشر الإعلانات في الصحف',
      'إقامة عروض تجارية',
      'بيع المنتجات عبر الهاتف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالعينات؟',
    'options': [
      'تقديم عينات مجانية من المنتجات للعملاء المحتملين',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في الصحف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالعلاقات العامة؟',
    'options': [
      'بناء علاقات إيجابية مع الجمهور ووسائل الإعلام',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في الصحف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق العاطفي؟',
    'options': [
      'استخدام العواطف والمشاعر لجذب العملاء',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في الصحف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الدور الرئيسي للأبحاث السوقية؟',
    'options': [
      'فهم احتياجات وتفضيلات العملاء وتحليل السوق',
      'زيادة التكاليف',
      'تقليل المبيعات',
      'زيادة عدد الموظفين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالإحالة؟',
    'options': [
      'تشجيع العملاء الحاليين على إحالة عملاء جدد',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في الصحف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق الأخضر؟',
    'options': [
      'استخدام استراتيجيات تسويقية صديقة للبيئة',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في الصحف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالخدمات؟',
    'options': [
      'تقديم خدمات إضافية للعملاء',
      'بيع المنتجات فقط',
      'نشر الإعلانات في الصحف',
      'إقامة عروض تجارية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق بالتجزئة؟',
    'options': [
      'بيع المنتجات مباشرة للعملاء في المتاجر',
      'بيع المنتجات عبر الهاتف',
      'إقامة معارض تجارية',
      'نشر الإعلانات في الصحف'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التسويق الشخصي؟',
    'options': [
      'بيع المنتجات مباشرة للعملاء وجهًا لوجه',
      'إرسال رسائل بريدية',
      'الترويج عبر الإنترنت',
      'التسويق عبر الهاتف'
    ],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> SEOQues = [
  {
    'question': 'ما هو SEO؟',
    'options': [
      'تحسين محركات البحث',
      'تحليل البيانات',
      'إدارة المحتوى',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الكلمات الرئيسية (Keywords)؟',
    'options': [
      'كلمات البحث التي يستهدفها الموقع',
      'روابط الموقع',
      'تصميم الموقع',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من تحسين محركات البحث؟',
    'options': [
      'زيادة عدد الزوار إلى الموقع',
      'تصميم الموقع بشكل أفضل',
      'إضافة ميزات جديدة للموقع',
      'إدارة محتوى الموقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الميتا تاغات (Meta Tags)؟',
    'options': [
      'وصف محتوى الصفحة لمحركات البحث',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الباك لينك (Backlink)؟',
    'options': [
      'رابط من موقع آخر يشير إلى موقعك',
      'روابط داخلية في الموقع',
      'كلمات رئيسية',
      'صور الموقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي محركات البحث الأكثر استخداماً؟',
    'options': ['Google', 'Bing', 'Yahoo', 'جميع ما سبق'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هي الأداة المستخدمة لتحليل الكلمات الرئيسية؟',
    'options': [
      'Google Analytics',
      'Google Keyword Planner',
      'Google Search Console',
      'Google Ads'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو معدل الارتداد (Bounce Rate)؟',
    'options': [
      'نسبة الزوار الذين يغادرون الموقع بعد مشاهدة صفحة واحدة فقط',
      'نسبة الزوار الذين يقومون بشراء منتجات',
      'نسبة الزوار الذين يشاهدون فيديوهات الموقع',
      'نسبة الزوار الذين يعلقون على المقالات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ CTR؟',
    'options': [
      'معدل النقر إلى الظهور',
      'معدل الارتداد',
      'معدل الزيارات',
      'معدل الشراء'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الزحف (Crawling) في SEO؟',
    'options': [
      'عملية قراءة وتحليل محركات البحث لمحتوى الموقع',
      'تصميم الموقع',
      'كتابة المقالات',
      'إنشاء الصور'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ SERP؟',
    'options': [
      'صفحات نتائج محركات البحث',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الروابط الداخلية (Internal Links)؟',
    'options': [
      'روابط تشير إلى صفحات داخل نفس الموقع',
      'روابط تشير إلى مواقع أخرى',
      'روابط تشير إلى الصور',
      'روابط تشير إلى المقالات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Alt Text؟',
    'options': [
      'نص بديل لوصف الصور لمحركات البحث',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Schema Markup؟',
    'options': [
      'كود يستخدم لتقديم معلومات منظمة لمحركات البحث',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ HTTPS؟',
    'options': [
      'بروتوكول نقل النص الفائق الآمن',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Robots.txt؟',
    'options': [
      'ملف يوجه محركات البحث حول كيفية الزحف إلى صفحات الموقع',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Sitemap؟',
    'options': [
      'ملف يحتوي على قائمة بصفحات الموقع لمساعدة محركات البحث في الزحف',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Domain Authority؟',
    'options': [
      'مقياس يقيم قوة الموقع وتأثيره على محركات البحث',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Page Speed؟',
    'options': [
      'سرعة تحميل صفحات الموقع',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Mobile-Friendly؟',
    'options': [
      'تصميم الموقع ليكون مناسباً للأجهزة المحمولة',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Content Marketing؟',
    'options': [
      'إنشاء ونشر محتوى قيم لجذب واستبقاء الجمهور',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الروابط الخارجية (External Links)؟',
    'options': [
      'روابط تشير إلى مواقع أخرى من موقعك',
      'روابط تشير إلى صفحات داخل نفس الموقع',
      'روابط تشير إلى الصور',
      'روابط تشير إلى المقالات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Organic Traffic؟',
    'options': [
      'الزيارات الناتجة عن نتائج البحث المجانية',
      'الزيارات الناتجة عن الإعلانات المدفوعة',
      'الزيارات الناتجة عن وسائل التواصل الاجتماعي',
      'الزيارات الناتجة عن الروابط الخارجية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Paid Traffic؟',
    'options': [
      'الزيارات الناتجة عن الإعلانات المدفوعة',
      'الزيارات الناتجة عن نتائج البحث المجانية',
      'الزيارات الناتجة عن وسائل التواصل الاجتماعي',
      'الزيارات الناتجة عن الروابط الخارجية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Local SEO؟',
    'options': [
      'تحسين محركات البحث لزيادة الظهور في البحث المحلي',
      'تحليل البيانات',
      'إدارة المحتوى',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Anchor Text؟',
    'options': [
      'النص الظاهر في الرابط الذي يمكن النقر عليه',
      'روابط الموقع',
      'الكلمات الرئيسية',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Bounce Rate؟',
    'options': [
      'نسبة الزوار الذين يغادرون الموقع بعد مشاهدة صفحة واحدة فقط',
      'نسبة الزوار الذين يقومون بشراء منتجات',
      'نسبة الزوار الذين يشاهدون فيديوهات الموقع',
      'نسبة الزوار الذين يعلقون على المقالات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Conversion Rate؟',
    'options': [
      'نسبة الزوار الذين يقومون بإجراء معين مثل الشراء أو التسجيل',
      'نسبة الزوار الذين يغادرون الموقع بعد مشاهدة صفحة واحدة فقط',
      'نسبة الزوار الذين يشاهدون فيديوهات الموقع',
      'نسبة الزوار الذين يعلقون على المقالات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Keyword Density؟',
    'options': [
      'نسبة تكرار الكلمات الرئيسية في النص بالنسبة لإجمالي عدد الكلمات',
      'عدد الكلمات في الصفحة',
      'عدد الصفحات في الموقع',
      'عدد الروابط في الصفحة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Long Tail Keyword؟',
    'options': [
      'عبارة بحث تحتوي على ثلاث كلمات أو أكثر وتكون أكثر تحديداً',
      'كلمة بحث قصيرة',
      'روابط الموقع',
      'أسماء الصفحات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ Google Analytics؟',
    'options': [
      'أداة لتحليل زيارات الموقع وأداءه',
      'أداة لتحليل الكلمات الرئيسية',
      'أداة لإدارة المحتوى',
      'أداة لإنشاء الإعلانات'
    ],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> CanvaQues = [
  {
    'question': 'ما هو Canva؟',
    'options': [
      'برنامج لتصميم الجرافيك',
      'برنامج لتحرير الفيديو',
      'برنامج للبرمجة',
      'برنامج لتحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الميزة الرئيسية في Canva؟',
    'options': [
      'إمكانية إنشاء تصميمات بسهولة باستخدام القوالب',
      'تحليل البيانات',
      'تحرير النصوص البرمجية',
      'إدارة قواعد البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الفئات المستهدفة باستخدام Canva؟',
    'options': [
      'المصممين المحترفين والهواة',
      'مبرمجي الويب',
      'خبراء الشبكات',
      'المهندسين المدنيين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question':
        'ما هي الأنواع المختلفة للتصميمات التي يمكن إنشاؤها باستخدام Canva؟',
    'options': [
      'منشورات السوشيال ميديا والملصقات والعروض التقديمية',
      'برامج الكمبيوتر',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي إحدى الميزات الهامة في Canva؟',
    'options': [
      'المكتبة الكبيرة من الصور والرسوم المتحركة',
      'تحرير الفيديو',
      'تحليل البيانات',
      'إدارة قواعد البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'كيف يمكنك مشاركة تصميماتك من Canva؟',
    'options': [
      'عبر الروابط أو تحميلها كملفات',
      'برمجتها',
      'تحليلها',
      'تخزينها في قواعد البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو Canva Pro؟',
    'options': [
      'خطة اشتراك مدفوعة تقدم ميزات إضافية',
      'برنامج لتحليل البيانات',
      'برنامج لتحرير الفيديو',
      'برنامج لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الميزات التي يوفرها Canva Pro؟',
    'options': [
      'مكتبة موسعة من الصور والقوالب وميزات تعاون الفريق',
      'تحليل البيانات',
      'تحرير الفيديو',
      'إدارة قواعد البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الأداة المستخدمة في Canva لإنشاء النصوص؟',
    'options': ['أداة النص', 'أداة الفيديو', 'أداة البيانات', 'أداة البرمجة'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الفائدة من استخدام القوالب في Canva؟',
    'options': [
      'تسهيل وتسريع عملية التصميم',
      'تحليل البيانات',
      'تحرير الفيديو',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أنواع الملفات التي يمكن تصديرها من Canva؟',
    'options': ['PNG, JPEG, PDF', 'HTML, CSS, JS', 'CSV, XML', 'MP4, AVI'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة Canva في تصميم العروض التقديمية؟',
    'options': [
      'إمكانية إضافة الرسوم المتحركة والانتقالات',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'كيف يمكنك استخدام الصور في Canva؟',
    'options': [
      'إدراج الصور من المكتبة أو تحميلها من جهازك',
      'برمجة الصور',
      'تحليل الصور',
      'تخزين الصور في قواعد البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة السحب والإفلات في Canva؟',
    'options': [
      'أداة لتسهيل وضع العناصر في التصميم',
      'أداة لتحليل البيانات',
      'أداة لتحرير الفيديو',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة التعاون في Canva؟',
    'options': [
      'إمكانية العمل مع فريق على نفس التصميم في الوقت الفعلي',
      'تحليل البيانات',
      'إدارة قواعد البيانات',
      'تحرير الفيديو'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'كيف يمكنك استخدام النصوص المتحركة في Canva؟',
    'options': [
      'باستخدام أداة النصوص المتحركة',
      'أداة الفيديو',
      'أداة تحليل البيانات',
      'أداة البرمجة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة Canva في تصميم السوشيال ميديا؟',
    'options': [
      'توفر قوالب مخصصة لمنشورات السوشيال ميديا',
      'تحليل البيانات',
      'إدارة قواعد البيانات',
      'تحرير الفيديو'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الأداة المستخدمة لتحرير الصور في Canva؟',
    'options': [
      'أداة تحرير الصور',
      'أداة البرمجة',
      'أداة تحليل البيانات',
      'أداة إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الميزة الفريدة في Canva لتصميم الشعارات؟',
    'options': [
      'وجود مكتبة كبيرة من الرموز والخطوط',
      'تحليل البيانات',
      'إدارة قواعد البيانات',
      'تحرير الفيديو'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة استخدام الرسوم المتحركة في Canva؟',
    'options': [
      'إضافة حيوية للتصميم',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو Canva Print؟',
    'options': [
      'خدمة طباعة التصاميم وتسليمها',
      'برنامج لتحليل البيانات',
      'برنامج لتحرير الفيديو',
      'برنامج لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'كيف يمكنك استخدام الأشكال في Canva؟',
    'options': [
      'إدراج الأشكال من المكتبة أو رسمها بنفسك',
      'برمجة الأشكال',
      'تحليل الأشكال',
      'تخزين الأشكال في قواعد البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الفائدة من استخدام الفلاتر في Canva؟',
    'options': [
      'تحسين مظهر الصور والتصميمات',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الميزة الخاصة بإدارة العلامة التجارية في Canva Pro؟',
    'options': [
      'إمكانية حفظ وتطبيق عناصر العلامة التجارية بسهولة',
      'تحليل البيانات',
      'إدارة قواعد البيانات',
      'تحرير الفيديو'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو Canva Education؟',
    'options': [
      'نسخة من Canva مخصصة للمؤسسات التعليمية',
      'برنامج لتحليل البيانات',
      'برنامج لتحرير الفيديو',
      'برنامج لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة تحميل التصميمات بجودة عالية في Canva؟',
    'options': [
      'إمكانية تحميل التصميمات بدقة عالية للطباعة',
      'تحليل البيانات',
      'إدارة قواعد البيانات',
      'تحرير الفيديو'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة Canva Video؟',
    'options': [
      'أداة لإنشاء وتحرير الفيديوهات',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة استخدام الأيقونات في Canva؟',
    'options': [
      'إمكانية إضافة رموز تعبيرية وأيقونات متنوعة للتصميم',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة Canva Grid؟',
    'options': [
      'أداة لترتيب العناصر بسهولة في التصميم',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة Canva Frames؟',
    'options': [
      'أداة لوضع الصور داخل إطارات محددة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> UIUXQues = [
  {
    'question': 'ما هو الهدف الرئيسي لتصميم تجربة المستخدم (UX)؟',
    'options': [
      'تحسين الأداء التقني للموقع',
      'تحسين تجربة المستخدم وجعلها أكثر سلاسة',
      'تعزيز الأمان',
      'زيادة عدد الزوار'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين UI و UX؟',
    'options': [
      'UI تركز على تجربة المستخدم وUX تركز على التصميم',
      'UI تركز على التصميم وUX تركز على تجربة المستخدم',
      'UI و UX كلاهما يركزان على التصميم فقط',
      'UI و UX كلاهما يركزان على تجربة المستخدم فقط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الأداة المستخدمة لإنشاء النماذج الأولية (Prototypes)؟',
    'options': ['Photoshop', 'Sketch', 'Excel', 'Word'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من اختبار قابلية الاستخدام؟',
    'options': [
      'تحليل أداء الموقع',
      'تحسين تجربة المستخدم',
      'زيادة عدد الزوار',
      'تعزيز الأمان'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو العنصر الأكثر أهمية في تصميم واجهة المستخدم (UI)؟',
    'options': ['الألوان', 'الصور', 'التفاعل وسهولة الاستخدام', 'الخطوط'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي الأداة المستخدمة في تصميم واجهة المستخدم؟',
    'options': ['Sketch', 'Word', 'Excel', 'PowerPoint'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو تصميم "الاستجابة" في واجهات المستخدم؟',
    'options': [
      'تصميم يتكيف مع مختلف أحجام الشاشات',
      'تصميم يتكيف مع مختلف الألوان',
      'تصميم يتكيف مع مختلف الخطوط',
      'تصميم يتكيف مع مختلف الأنظمة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "النموذج الأولي" في تصميم UX؟',
    'options': [
      'موقع كامل جاهز',
      'تصميم أولي للموقع لاختبار الفكرة',
      'مجموعة من الصور للموقع',
      'مخطط البيانات للموقع'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي عملية البحث في UX؟',
    'options': [
      'جمع البيانات لفهم احتياجات المستخدمين',
      'تصميم واجهات المستخدم',
      'كتابة الأكواد البرمجية',
      'تحليل الأداء'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو العنصر الأساسي في تصميم UX؟',
    'options': ['التفاعل وسهولة الاستخدام', 'الصور', 'الألوان', 'الخطوط'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين Sketch و Photoshop؟',
    'options': [
      'Sketch يستخدم لتصميم الجرافيك و Photoshop لتصميم UI',
      'Sketch يستخدم لتصميم UI و Photoshop لتصميم الجرافيك',
      'كلاهما يستخدمان لنفس الغرض',
      'Sketch يستخدم لتحرير الفيديو و Photoshop لتصميم الجرافيك'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو "تدفق المستخدم" (User Flow)؟',
    'options': [
      'الطريقة التي يتنقل بها المستخدم داخل التطبيق أو الموقع',
      'تصميم واجهة المستخدم',
      'تحديد ألوان الموقع',
      'تحليل أداء الموقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من تصميم واجهة مستخدم (UI) سهلة الاستخدام؟',
    'options': [
      'جعل الموقع أكثر جمالاً',
      'زيادة عدد الزوار',
      'تحسين تجربة المستخدم',
      'تعزيز الأمان'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو "التصميم المتجاوب" (Responsive Design)؟',
    'options': [
      'تصميم يتكيف مع مختلف أحجام الشاشات والأجهزة',
      'تصميم يتكيف مع مختلف الألوان',
      'تصميم يتكيف مع مختلف الخطوط',
      'تصميم يتكيف مع مختلف الأنظمة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "النموذج الأولي منخفض الدقة" (Low-Fidelity Prototype)؟',
    'options': [
      'نموذج أولي يحتوي على تفاصيل كاملة',
      'نموذج أولي بسيط يعرض الفكرة الأساسية',
      'مجموعة من الصور للموقع',
      'مخطط البيانات للموقع'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو "التصميم التجريبي" (A/B Testing)؟',
    'options': [
      'اختبار نسختين مختلفتين لمعرفة أيهما أفضل',
      'تحليل أداء الموقع',
      'جمع البيانات لفهم احتياجات المستخدمين',
      'تصميم واجهات المستخدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الأداة المستخدمة لتحليل تجربة المستخدم؟',
    'options': ['Google Analytics', 'Photoshop', 'Sketch', 'Excel'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "التصميم التفاعلي" (Interactive Design)؟',
    'options': [
      'تصميم يتفاعل مع تفاعلات المستخدمين',
      'تصميم يحتوي على صور تفاعلية',
      'تصميم يحتوي على ألوان تفاعلية',
      'تصميم يحتوي على خطوط تفاعلية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "اختبار المستخدم" (User Testing)؟',
    'options': [
      'اختبار أداء الموقع',
      'اختبار تفاعلات المستخدمين مع الموقع',
      'اختبار ألوان الموقع',
      'اختبار أمان الموقع'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو "تدفق المستخدم" (User Journey)؟',
    'options': [
      'الطريقة التي يتنقل بها المستخدم داخل التطبيق أو الموقع',
      'تحديد ألوان الموقع',
      'تحليل أداء الموقع',
      'تصميم واجهة المستخدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين "التصميم التفاعلي" و"التصميم التجريبي"؟',
    'options': [
      'التصميم التفاعلي يركز على تفاعلات المستخدم والتصميم التجريبي يركز على اختبار نسخ متعددة',
      'التصميم التفاعلي يركز على الألوان والتصميم التجريبي يركز على الصور',
      'كلاهما يركزان على تفاعلات المستخدم',
      'التصميم التفاعلي يركز على الخطوط والتصميم التجريبي يركز على الأمان'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "التصميم المستخدم" (User-Centered Design)؟',
    'options': [
      'تصميم يركز على احتياجات المستخدم وتجربته',
      'تصميم يركز على الألوان',
      'تصميم يركز على الصور',
      'تصميم يركز على الخطوط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "التحليل النوعي" (Qualitative Analysis)؟',
    'options': [
      'تحليل البيانات الكمية',
      'تحليل البيانات النوعية لفهم تجارب المستخدمين',
      'تحليل أداء الموقع',
      'تحليل الألوان والخطوط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو "التحليل الكمي" (Quantitative Analysis)؟',
    'options': [
      'تحليل البيانات الكمية لفهم تجارب المستخدمين',
      'تحليل البيانات النوعية',
      'تحليل أداء الموقع',
      'تحليل الألوان والخطوط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "التحليل الوظيفي" (Functional Analysis)؟',
    'options': [
      'تحليل وظائف الموقع والتأكد من عملها بشكل صحيح',
      'تحليل البيانات الكمية',
      'تحليل البيانات النوعية',
      'تحليل الألوان والخطوط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "تصميم السرد القصصي" (Storytelling Design)؟',
    'options': [
      'تصميم يستخدم السرد القصصي لتحسين تجربة المستخدم',
      'تصميم يستخدم الصور لتحسين تجربة المستخدم',
      'تصميم يستخدم الألوان لتحسين تجربة المستخدم',
      'تصميم يستخدم الخطوط لتحسين تجربة المستخدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "التحليل التنافسي" (Competitive Analysis)؟',
    'options': [
      'تحليل أداء المنافسين لتحديد نقاط القوة والضعف',
      'تحليل البيانات الكمية',
      'تحليل البيانات النوعية',
      'تحليل وظائف الموقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "التصميم التكراري" (Iterative Design)؟',
    'options': [
      'تصميم يعتمد على تكرار العمليات وتحسينها باستمرار',
      'تصميم يعتمد على الألوان',
      'تصميم يعتمد على الخطوط',
      'تصميم يعتمد على الصور'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو "تجربة المستخدم الشاملة" (Holistic User Experience)؟',
    'options': [
      'تجربة تأخذ في الاعتبار جميع جوانب تفاعل المستخدم مع المنتج',
      'تجربة تركز على الألوان',
      'تجربة تركز على الخطوط',
      'تجربة تركز على الصور'
    ],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> PhotoShopQues = [
  {
    'question': 'ما هو Photoshop؟',
    'options': [
      'برنامج لتحرير الصور',
      'برنامج لتحليل البيانات',
      'برنامج لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الطبقات (Layers) في Photoshop؟',
    'options': [
      'أداة لتنظيم العناصر المختلفة في التصميم',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الفائدة من استخدام الأقنعة (Masks) في Photoshop؟',
    'options': [
      'إخفاء أو إظهار أجزاء من الطبقات',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة الفرشاة (Brush Tool)؟',
    'options': [
      'أداة للرسم والتلوين',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين النوافذ المختلفة في Photoshop؟',
    'options': [
      'تتيح تخصيص واجهة البرنامج حسب الحاجة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار لفتح مشروع جديد في Photoshop؟',
    'options': ['Ctrl + N', 'Ctrl + O', 'Ctrl + S', 'Ctrl + P'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة التحديد السريع (Quick Selection Tool)؟',
    'options': [
      'أداة لتحديد الأجزاء بسرعة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور أداة النص (Text Tool) في Photoshop؟',
    'options': [
      'إضافة النصوص وتحريرها في التصميم',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة النسخ والاستنساخ (Clone Stamp Tool)؟',
    'options': [
      'أداة لنسخ أجزاء من الصورة إلى أماكن أخرى',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة القص (Crop Tool)؟',
    'options': [
      'أداة لقص أجزاء من الصورة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور الفلاتر (Filters) في Photoshop؟',
    'options': [
      'تطبيق تأثيرات متنوعة على الصور',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة التحويل الحر (Free Transform Tool)؟',
    'options': [
      'أداة لتغيير حجم وتدوير وتشويه العناصر',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور أداة الممحاة (Eraser Tool) في Photoshop؟',
    'options': [
      'إزالة أجزاء من الطبقات أو الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة التمويه (Blur Tool)؟',
    'options': [
      'أداة لتمويه أجزاء من الصورة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور أداة الحرق (Burn Tool)؟',
    'options': [
      'تغميق أجزاء من الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة التوضيح (Dodge Tool)؟',
    'options': [
      'تفتيح أجزاء من الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة الفرشاة التصحيحية (Healing Brush Tool)؟',
    'options': [
      'إصلاح العيوب في الصور باستخدام نسخ أجزاء من الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار لتكبير وتصغير الشاشة في Photoshop؟',
    'options': [
      'Ctrl + + و Ctrl + -',
      'Ctrl + Alt',
      'Ctrl + Shift',
      'Ctrl + N'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة السهم (Move Tool)؟',
    'options': [
      'تحريك الطبقات والعناصر في التصميم',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور أداة العين الحمراء (Red Eye Tool)؟',
    'options': [
      'إزالة العين الحمراء من الصور',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو استخدام أداة اليد (Hand Tool)؟',
    'options': [
      'تحريك العرض في مساحة العمل',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة العصا السحرية (Magic Wand Tool)؟',
    'options': [
      'تحديد الأجزاء ذات الألوان المتشابهة في الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور أداة التحديد (Lasso Tool)؟',
    'options': [
      'تحديد الأجزاء بشكل حر في الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين أداة التحديد السريع والعصا السحرية؟',
    'options': [
      'التحديد السريع يستخدم للحواف المعقدة، والعصا السحرية للألوان المتشابهة',
      'التحديد السريع للألوان المتشابهة، والعصا السحرية للحواف المعقدة',
      'كلاهما يستخدمان لنفس الغرض',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ميزة استخدام Smart Objects في Photoshop؟',
    'options': [
      'إمكانية تعديل العناصر دون فقدان الجودة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار لحفظ العمل في Photoshop؟',
    'options': ['Ctrl + S', 'Ctrl + O', 'Ctrl + N', 'Ctrl + P'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة تحديد المستطيل (Rectangular Marquee Tool)؟',
    'options': [
      'تحديد الأجزاء بشكل مستطيل في الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو استخدام أداة التدرج اللوني (Gradient Tool)؟',
    'options': [
      'تطبيق تأثيرات التدرج اللوني على الصورة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دور أداة الممحاة الخلفية (Background Eraser Tool)؟',
    'options': [
      'إزالة خلفية الصورة بدقة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أداة الباث (Pen Tool)؟',
    'options': [
      'إنشاء ورسم المسارات الدقيقة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار للتراجع عن خطوة في Photoshop؟',
    'options': ['Ctrl + Z', 'Ctrl + X', 'Ctrl + C', 'Ctrl + V'],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> ICDLQues = [
  {
    'question': 'ما هي الرخصة الدولية لقيادة الحاسب الآلي (ICDL)؟',
    'options': [
      'شهادة في البرمجة',
      'شهادة في إدارة الأعمال',
      'شهادة في المهارات الأساسية لاستخدام الحاسوب',
      'شهادة في التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي أحد الأهداف الرئيسية لـ ICDL؟',
    'options': [
      'تعليم البرمجة',
      'تعزيز مهارات استخدام الحاسوب',
      'تعليم التصميم الجرافيكي',
      'تعليم التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نظام التشغيل الذي يتم تعليمه في ICDL؟',
    'options': ['Windows', 'MacOS', 'Kali Linux', 'Ubuntu'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو برنامج معالجة النصوص الذي يتم تدريسه في ICDL؟',
    'options': ['Excel', 'PowerPoint', 'Word', 'Access'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو البرنامج المستخدم لإنشاء العروض التقديمية في ICDL؟',
    'options': ['Word', 'Excel', 'PowerPoint', 'Access'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو برنامج الجداول الإلكترونية الذي يتم تدريسه في ICDL؟',
    'options': ['Word', 'Excel', 'PowerPoint', 'Access'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو البرنامج المستخدم لإدارة قواعد البيانات في ICDL؟',
    'options': ['Word', 'Excel', 'PowerPoint', 'Access'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الهدف من تعلم البريد الإلكتروني في ICDL؟',
    'options': [
      'إدارة الصور',
      'إدارة الرسائل الإلكترونية',
      'تصميم المواقع',
      'تحرير الفيديو'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أحد المكونات الأساسية للحاسوب التي يتم تدريسها في ICDL؟',
    'options': [
      'وحدة المعالجة المركزية (CPU)',
      'الماوس',
      'الشاشة',
      'لوحة المفاتيح'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question':
        'ما هو المصطلح الذي يشير إلى حماية المعلومات والبيانات في الحاسوب؟',
    'options': ['التشفير', 'الأمان', 'الجدار الناري', 'النسخ الاحتياطي'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الاختصار الذي يشير إلى نظام التشغيل؟',
    'options': ['OS', 'CPU', 'RAM', 'HDD'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار الذي يشير إلى وحدة المعالجة المركزية؟',
    'options': ['OS', 'CPU', 'RAM', 'HDD'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الاختصار الذي يشير إلى ذاكرة الوصول العشوائي؟',
    'options': ['OS', 'CPU', 'RAM', 'HDD'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الاختصار الذي يشير إلى القرص الصلب؟',
    'options': ['OS', 'CPU', 'RAM', 'HDD'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هي الأداة المستخدمة للبحث عن الملفات في Windows؟',
    'options': ['Explorer', 'Finder', 'Search', 'Task Manager'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو البرنامج المستخدم لإنشاء الرسوم البيانية في Excel؟',
    'options': ['Chart', 'Graph', 'Diagram', 'Plot'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار الذي يستخدم لحفظ الملف في معظم البرامج؟',
    'options': ['Ctrl + O', 'Ctrl + S', 'Ctrl + P', 'Ctrl + N'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الاختصار الذي يستخدم لفتح ملف في معظم البرامج؟',
    'options': ['Ctrl + O', 'Ctrl + S', 'Ctrl + P', 'Ctrl + N'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار الذي يستخدم لإنشاء ملف جديد في معظم البرامج؟',
    'options': ['Ctrl + O', 'Ctrl + S', 'Ctrl + P', 'Ctrl + N'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الاختصار الذي يستخدم لطباعة ملف في معظم البرامج؟',
    'options': ['Ctrl + O', 'Ctrl + S', 'Ctrl + P', 'Ctrl + N'],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو المصطلح الذي يشير إلى إرسال نسخة من البريد الإلكتروني إلى شخص آخر؟',
    'options': ['BCC', 'CC', 'Forward', 'Reply'],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو المصطلح الذي يشير إلى الرد على جميع المستقبلين في البريد الإلكتروني؟',
    'options': ['BCC', 'CC', 'Forward', 'Reply All'],
    'correctOptionIndex': 3,
  },
  {
    'question':
        'ما هو المصطلح الذي يشير إلى إرسال بريد إلكتروني إلى عدة أشخاص دون معرفة بعضهم البعض؟',
    'options': ['BCC', 'CC', 'Forward', 'Reply All'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار الذي يستخدم لنسخ النص في معظم البرامج؟',
    'options': ['Ctrl + X', 'Ctrl + C', 'Ctrl + V', 'Ctrl + Z'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الاختصار الذي يستخدم لقص النص في معظم البرامج؟',
    'options': ['Ctrl + X', 'Ctrl + C', 'Ctrl + V', 'Ctrl + Z'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاختصار الذي يستخدم للصق النص في معظم البرامج؟',
    'options': ['Ctrl + X', 'Ctrl + C', 'Ctrl + V', 'Ctrl + Z'],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو الاختصار الذي يستخدم للتراجع عن الإجراء الأخير في معظم البرامج؟',
    'options': ['Ctrl + X', 'Ctrl + C', 'Ctrl + V', 'Ctrl + Z'],
    'correctOptionIndex': 3,
  },
  {
    'question':
        'ما هو المصطلح الذي يشير إلى نقل البيانات من الإنترنت إلى جهاز الحاسوب؟',
    'options': ['Upload', 'Download', 'Sync', 'Share'],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو المصطلح الذي يشير إلى نقل البيانات من جهاز الحاسوب إلى الإنترنت؟',
    'options': ['Upload', 'Download', 'Sync', 'Share'],
    'correctOptionIndex': 0,
  },
  {
    'question':
        'ما هو البرنامج المستخدم لإدارة البريد الإلكتروني في مجموعة Microsoft Office؟',
    'options': ['Word', 'Excel', 'PowerPoint', 'Outlook'],
    'correctOptionIndex': 3,
  },
];

const List<Map<String, dynamic>> ITQues = [
  {
    'question': 'ما هو نظام التشغيل؟',
    'options': [
      'برنامج يدير مكونات الحاسوب والبرامج',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من الجدار الناري (Firewall)؟',
    'options': [
      'حماية الشبكة من الوصول غير المصرح به',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الشبكة المحلية (LAN)؟',
    'options': [
      'شبكة تربط أجهزة الكمبيوتر داخل منطقة صغيرة',
      'شبكة تربط أجهزة الكمبيوتر عبر مسافات طويلة',
      'شبكة لتحليل البيانات',
      'شبكة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو البروتوكول؟',
    'options': [
      'مجموعة من القواعد لتنظيم الاتصال بين الأجهزة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو عنوان IP؟',
    'options': [
      'عنوان فريد يحدد جهازًا على الشبكة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي ذاكرة الوصول العشوائي (RAM)؟',
    'options': [
      'ذاكرة مؤقتة يستخدمها الحاسوب لتخزين البيانات المؤقتة',
      'ذاكرة دائمة لتخزين البيانات',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو القرص الصلب (Hard Drive)؟',
    'options': [
      'جهاز لتخزين البيانات بشكل دائم',
      'ذاكرة مؤقتة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفيروس؟',
    'options': [
      'برنامج ضار يتكاثر ويصيب الملفات والأنظمة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو النسخ الاحتياطي (Backup)؟',
    'options': [
      'عملية إنشاء نسخ من البيانات لحمايتها من الفقدان',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الـ DNS؟',
    'options': [
      'نظام لتحويل أسماء النطاقات إلى عناوين IP',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الحوسبة السحابية (Cloud Computing)؟',
    'options': [
      'استخدام خدمات الحوسبة عبر الإنترنت',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التشفير (Encryption)؟',
    'options': [
      'تحويل البيانات إلى صيغة غير قابلة للقراءة إلا بمفتاح خاص',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من النسخ الاحتياطي التزايدي (Incremental Backup)؟',
    'options': [
      'نسخ الملفات التي تم تغييرها منذ آخر نسخ احتياطي',
      'نسخ جميع الملفات',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفأرة (Mouse)؟',
    'options': [
      'جهاز إدخال يستخدم للتحكم في المؤشر على الشاشة',
      'جهاز تخزين البيانات',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو البريد الإلكتروني (Email)؟',
    'options': [
      'طريقة لتبادل الرسائل الإلكترونية عبر الإنترنت',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الذاكرة الدائمة (ROM)؟',
    'options': [
      'ذاكرة تخزن البيانات بشكل دائم ولا يمكن تغييرها بسهولة',
      'ذاكرة مؤقتة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الشبكة الواسعة (WAN)؟',
    'options': [
      'شبكة تربط أجهزة الكمبيوتر عبر مسافات طويلة',
      'شبكة تربط أجهزة الكمبيوتر داخل منطقة صغيرة',
      'شبكة لتحليل البيانات',
      'شبكة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام بروتوكول HTTP؟',
    'options': [
      'نقل صفحات الويب عبر الإنترنت',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو برنامج مكافحة الفيروسات؟',
    'options': [
      'برنامج يكتشف ويزيل الفيروسات والبرامج الضارة',
      'برنامج لتحليل البيانات',
      'برنامج لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو عنوان MAC؟',
    'options': [
      'عنوان فريد يحدد جهازًا على الشبكة المحلية',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'برنامج لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين HTTP و HTTPS؟',
    'options': [
      'HTTPS يوفر اتصالاً مشفرًا وآمنًا',
      'HTTP يوفر اتصالاً مشفرًا وآمنًا',
      'كلاهما يوفران نفس الأمان',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو النظام المفتوح المصدر (Open Source)?',
    'options': [
      'نظام يمكن لأي شخص الاطلاع على شيفرته البرمجية وتعديلها',
      'نظام مغلق لا يمكن الاطلاع على شيفرته البرمجية',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام VPN؟',
    'options': [
      'توفير اتصال آمن ومشفر عبر الإنترنت',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو التخزين السحابي (Cloud Storage)؟',
    'options': [
      'تخزين البيانات عبر الإنترنت للوصول إليها من أي مكان',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام قاعدة البيانات؟',
    'options': [
      'تخزين وتنظيم البيانات بشكل يمكن الوصول إليها بسهولة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو DHCP؟',
    'options': [
      'بروتوكول يوزع عناوين IP تلقائيًا على الأجهزة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'برمجة المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين SSD و HDD؟',
    'options': [
      'SSD أسرع ويستخدم ذاكرة فلاش، و HDD أبطأ ويستخدم أقراص مغناطيسية',
      'HDD أسرع ويستخدم ذاكرة فلاش، و SSD أبطأ ويستخدم أقراص مغناطيسية',
      'كلاهما يعملان بنفس الطريقة',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من التحديثات الأمنية؟',
    'options': [
      'إصلاح الثغرات الأمنية وحماية النظام من الهجمات',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو النظام الثنائي (Binary System)؟',
    'options': [
      'نظام عد يستخدم القيمتين 0 و 1',
      'نظام عد يستخدم القيم من 0 إلى 9',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام RAID؟',
    'options': [
      'زيادة الأداء وحماية البيانات عبر توزيعها على عدة أقراص',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> TOTQues = [
  {
    'question': 'ما هو الهدف الرئيسي من دورة TOT؟',
    'options': [
      'تعلم البرمجة',
      'تدريب المدربين على تطوير مهارات التدريب',
      'تعلم التصوير الفوتوغرافي',
      'تعلم التصميم الجرافيكي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أحدى المهارات الأساسية التي يتم تدريسها في دورة TOT؟',
    'options': [
      'مهارات العرض والتقديم',
      'مهارات الطهي',
      'مهارات السباحة',
      'مهارات قيادة السيارات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الدور الأساسي للمدرب؟',
    'options': [
      'إلقاء المحاضرات فقط',
      'توجيه المشاركين وتطوير مهاراتهم',
      'القيام بأعمال إدارية',
      'تصميم مواقع الويب'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أهمية التخطيط للتدريب؟',
    'options': [
      'تقليل التكاليف',
      'زيادة الفعالية وتحقيق الأهداف',
      'زيادة عدد المشاركين',
      'تحسين نوعية الطعام المقدم'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نموذج كيركباتريك لتقييم التدريب؟',
    'options': [
      'نموذج لتصميم المناهج',
      'نموذج لتقييم فعالية التدريب',
      'نموذج لإدارة الوقت',
      'نموذج لتحليل البيانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو العنصر الأساسي في التواصل الفعّال؟',
    'options': [
      'الاستماع النشط',
      'التحدث بسرعة',
      'استخدام الكلمات الصعبة',
      'التواصل عبر البريد الإلكتروني فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام الوسائل البصرية في التدريب؟',
    'options': [
      'جعل العرض أكثر جاذبية',
      'زيادة التعقيد',
      'تقليل مدة التدريب',
      'زيادة حجم النصوص'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أهمية تقييم أداء المشاركين؟',
    'options': [
      'تحقيق الربح',
      'تحسين أداء المشاركين',
      'زيادة عدد المشاركين',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين التدريب والتعليم؟',
    'options': [
      'التدريب يركز على المهارات العملية، والتعليم يركز على المعرفة النظرية',
      'التعليم يركز على المهارات العملية، والتدريب يركز على المعرفة النظرية',
      'التدريب والتعليم هما نفس الشيء',
      'التدريب يركز على الأطفال، والتعليم يركز على الكبار'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من تحليل الاحتياجات التدريبية؟',
    'options': [
      'تحديد الفجوات في المعرفة والمهارات',
      'زيادة عدد المشاركين',
      'تقليل التكاليف',
      'تحسين نوعية الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أحدى أساليب التدريب الفعّالة؟',
    'options': [
      'التحدث بسرعة',
      'استخدام الأنشطة التفاعلية',
      'تجنب التفاعل مع المشاركين',
      'الاعتماد على المحاضرات فقط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من استخدام الألعاب التدريبية؟',
    'options': [
      'زيادة التفاعل والمشاركة',
      'تقليل مدة التدريب',
      'زيادة حجم النصوص',
      'تحسين نوعية الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الدور الأساسي للتقييم في التدريب؟',
    'options': [
      'تحقيق الربح',
      'تحسين أداء المدربين والمشاركين',
      'زيادة عدد المشاركين',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو العنصر الأساسي في بناء فريق عمل ناجح؟',
    'options': [
      'التواصل الفعّال',
      'زيادة الرواتب',
      'تقليل عدد الاجتماعات',
      'زيادة عدد المشاركين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من تصميم المناهج التدريبية؟',
    'options': [
      'تحقيق الأهداف التعليمية والتدريبية',
      'زيادة عدد المشاركين',
      'تقليل التكاليف',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أحدى مهارات المدرب الفعّال؟',
    'options': [
      'مهارات الطهي',
      'مهارات القيادة',
      'مهارات التحفيز',
      'مهارات السباحة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الدور الأساسي للمدرب في جلسة التدريب؟',
    'options': [
      'توجيه المشاركين وتسهيل التعلم',
      'تحضير الطعام',
      'إدارة الميزانية',
      'زيادة عدد المشاركين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أهمية استخدام التقنيات الحديثة في التدريب؟',
    'options': [
      'زيادة التفاعل والمشاركة',
      'زيادة التكاليف',
      'تقليل مدة التدريب',
      'تحسين نوعية الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من التعلم المستمر للمدربين؟',
    'options': [
      'تحقيق الربح',
      'تحسين مهاراتهم ومعرفتهم',
      'زيادة عدد المشاركين',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي أحدى الفوائد الرئيسية للتدريب التفاعلي؟',
    'options': [
      'زيادة التفاعل والمشاركة',
      'تقليل التكاليف',
      'زيادة حجم النصوص',
      'تحسين نوعية الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من وضع أهداف واضحة للتدريب؟',
    'options': [
      'تحقيق الأهداف التعليمية والتدريبية',
      'زيادة عدد المشاركين',
      'تقليل التكاليف',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو العنصر الأساسي في تحفيز المشاركين؟',
    'options': [
      'زيادة الرواتب',
      'التواصل الفعّال',
      'تقليل عدد الاجتماعات',
      'زيادة عدد المشاركين'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من استخدام التغذية الراجعة في التدريب؟',
    'options': [
      'تحسين أداء المشاركين',
      'زيادة عدد المشاركين',
      'تقليل التكاليف',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أحدى الأساليب الفعّالة لتحفيز المشاركين؟',
    'options': [
      'تجنب التفاعل مع المشاركين',
      'استخدام الأنشطة التفاعلية',
      'الاعتماد على المحاضرات فقط',
      'التحدث بسرعة'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من استخدام الأمثلة العملية في التدريب؟',
    'options': [
      'زيادة التفاعل والفهم',
      'تقليل مدة التدريب',
      'زيادة حجم النصوص',
      'تحسين نوعية الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الدور الأساسي للمدرب في بناء الثقة مع المشاركين؟',
    'options': [
      'تقديم الدعم والتوجيه',
      'زيادة الرواتب',
      'تقليل عدد الاجتماعات',
      'زيادة عدد المشاركين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أهمية وضع خطط للتطوير الشخصي للمدربين؟',
    'options': [
      'تحقيق الأهداف التعليمية والتدريبية',
      'زيادة عدد المشاركين',
      'تقليل التكاليف',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام الأدوات التكنولوجية في التدريب؟',
    'options': [
      'زيادة التفاعل والمشاركة',
      'زيادة التكاليف',
      'تقليل مدة التدريب',
      'تحسين نوعية الطعام المقدم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي أحدى المهارات الأساسية التي يجب أن يمتلكها المدرب؟',
    'options': [
      'مهارات التفاوض',
      'مهارات العرض والتقديم',
      'مهارات الطهي',
      'مهارات السباحة'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من تحليل الأداء في التدريب؟',
    'options': [
      'تحقيق الربح',
      'تحسين أداء المشاركين',
      'زيادة عدد المشاركين',
      'تحسين جودة الطعام المقدم'
    ],
    'correctOptionIndex': 1,
  },
];

const List<Map<String, dynamic>> AccAdminQues = [
  {
    'question': 'ما هو المحاسبة؟',
    'options': [
      'علم تسجيل وتفسير البيانات المالية',
      'علم تحليل البيانات',
      'علم إدارة المشاريع',
      'علم تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف الرئيسي من إعداد الميزانية العمومية؟',
    'options': [
      'عرض الأصول والخصوم وحقوق الملكية للشركة في نهاية الفترة المالية',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الدورة المحاسبية؟',
    'options': [
      'الخطوات المتبعة لتسجيل وتلخيص وتقرير المعاملات المالية',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دفتر الأستاذ العام؟',
    'options': [
      'سجل يحتوي على جميع حسابات الشركة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو البيان المالي؟',
    'options': [
      'وثيقة توضح الوضع المالي للشركة وأدائها المالي',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع',
      'أداة لتصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين الأصول والخصوم؟',
    'options': [
      'الأصول هي ممتلكات الشركة، والخصوم هي التزاماتها',
      'الأصول هي التزامات الشركة، والخصوم هي ممتلكاتها',
      'كلاهما يعنيان نفس الشيء',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الحساب الدائن؟',
    'options': [
      'التزام مالي على الشركة تجاه الموردين',
      'أصل تمتلكه الشركة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الحساب المدين؟',
    'options': [
      'مبلغ مستحق للشركة من العملاء',
      'التزام مالي على الشركة تجاه الموردين',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو النقدية؟',
    'options': [
      'الأموال المتاحة للشركة في البنك أو في متناول اليد',
      'الأصول الثابتة',
      'أداة لتحليل البيانات',
      'أداة لإدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الاستهلاك؟',
    'options': [
      'تخفيض قيمة الأصول الثابتة على مدى عمرها الإنتاجي',
      'زيادة قيمة الأصول الثابتة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الربح الإجمالي؟',
    'options': [
      'الإيرادات ناقص تكلفة البضائع المباعة',
      'الإيرادات ناقص المصروفات التشغيلية',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الربح الصافي؟',
    'options': [
      'الإيرادات ناقص جميع المصروفات',
      'الإيرادات ناقص تكلفة البضائع المباعة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي المصروفات التشغيلية؟',
    'options': [
      'التكاليف المرتبطة بتشغيل الأعمال التجارية اليومية',
      'التكاليف المرتبطة بشراء الأصول الثابتة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الحساب الجاري؟',
    'options': [
      'حساب بنكي يستخدم للمعاملات اليومية',
      'حساب لتوفير الأموال',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو القيد المزدوج؟',
    'options': [
      'نظام محاسبي يتطلب تسجيل كل معاملة في حسابين مختلفين على الأقل',
      'نظام محاسبي لتسجيل المعاملات مرة واحدة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دفتر اليومية؟',
    'options': [
      'سجل يحتوي على تفاصيل جميع المعاملات المالية بترتيب تاريخي',
      'سجل يحتوي على جميع حسابات الشركة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو قائمة التدفقات النقدية؟',
    'options': [
      'تقرير يوضح التدفقات النقدية الداخلة والخارجة من الشركة',
      'تقرير يوضح الأصول والخصوم وحقوق الملكية',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو رأس المال؟',
    'options': [
      'الأموال التي يستخدمها المالك لتأسيس الأعمال التجارية',
      'الأصول الثابتة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين المحاسبة المالية والمحاسبة الإدارية؟',
    'options': [
      'المحاسبة المالية تركز على التقارير الخارجية، والمحاسبة الإدارية تركز على التقارير الداخلية',
      'المحاسبة المالية تركز على التقارير الداخلية، والمحاسبة الإدارية تركز على التقارير الخارجية',
      'كلاهما يعنيان نفس الشيء',
      'تحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو المورد؟',
    'options': [
      'شخص أو شركة تقدم البضائع أو الخدمات للشركة',
      'العميل الذي يشتري البضائع أو الخدمات من الشركة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من التدقيق الداخلي؟',
    'options': [
      'تقييم وتحسين فعالية عمليات إدارة المخاطر والرقابة والحوكمة',
      'تحليل البيانات',
      'إدارة المشاريع',
      'تصميم المواقع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الفترة المالية؟',
    'options': [
      'الفترة الزمنية التي تغطيها التقارير المالية، عادةً تكون سنة',
      'الفترة الزمنية لتسديد الديون',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو دفتر الحسابات الدائنة؟',
    'options': [
      'سجل يحتوي على تفاصيل الديون التي يجب دفعها للموردين',
      'سجل يحتوي على تفاصيل الأموال المستحقة للشركة من العملاء',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو رأس المال العامل؟',
    'options': [
      'الأصول المتداولة ناقص الخصوم المتداولة',
      'الأصول الثابتة ناقص الخصوم الثابتة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو القيد الافتتاحي؟',
    'options': [
      'القيد المحاسبي الذي يتم تسجيله عند بدء الفترة المالية',
      'القيد المحاسبي الذي يتم تسجيله عند إغلاق الفترة المالية',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو القيد الختامي؟',
    'options': [
      'القيد المحاسبي الذي يتم تسجيله لإغلاق الحسابات في نهاية الفترة المالية',
      'القيد المحاسبي الذي يتم تسجيله عند بدء الفترة المالية',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو المصروفات الرأسمالية؟',
    'options': [
      'النفقات المستخدمة لشراء الأصول الثابتة',
      'النفقات التشغيلية اليومية',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو المصروفات التشغيلية؟',
    'options': [
      'التكاليف المرتبطة بتشغيل الأعمال التجارية اليومية',
      'التكاليف المرتبطة بشراء الأصول الثابتة',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو القرض؟',
    'options': [
      'مبلغ من المال يتم اقتراضه ويجب سداده بفائدة',
      'مبلغ من المال يتم اقتراضه ولا يجب سداده',
      'تحليل البيانات',
      'إدارة المشاريع'
    ],
    'correctOptionIndex': 0,
  },
];

const List<Map<String, dynamic>> CostAccQues = [
  {
    'question': 'ما هو الهدف الرئيسي من المحاسبة التكاليفية؟',
    'options': [
      'تحقيق الربح',
      'تحديد تكاليف الإنتاج والخدمات',
      'زيادة الإيرادات',
      'تحسين جودة المنتج'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي التكاليف المباشرة؟',
    'options': [
      'التكاليف التي يمكن تتبعها مباشرة إلى منتج أو خدمة معينة',
      'التكاليف التي لا يمكن تتبعها مباشرة إلى منتج أو خدمة معينة',
      'التكاليف التي تشمل الرواتب فقط',
      'التكاليف التي تشمل الإيجارات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو تعريف التكاليف غير المباشرة؟',
    'options': [
      'التكاليف التي تشمل الرواتب فقط',
      'التكاليف التي يمكن تتبعها مباشرة إلى منتج أو خدمة معينة',
      'التكاليف التي لا يمكن تتبعها مباشرة إلى منتج أو خدمة معينة',
      'التكاليف التي تشمل الإيجارات فقط'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين التكاليف الثابتة والمتغيرة؟',
    'options': [
      'التكاليف الثابتة تتغير مع حجم الإنتاج، والمتغيرة لا تتغير',
      'التكاليف المتغيرة تتغير مع حجم الإنتاج، والثابتة لا تتغير',
      'التكاليف الثابتة تشمل المواد الخام، والمتغيرة تشمل الرواتب',
      'التكاليف الثابتة تشمل الرواتب، والمتغيرة تشمل المواد الخام'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو النظام المستخدم لتخصيص التكاليف غير المباشرة؟',
    'options': [
      'نظام التكاليف المباشرة',
      'نظام التكاليف الثابتة',
      'نظام التكاليف المتغيرة',
      'نظام التكاليف المشتركة'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو تعريف تكلفة الفرصة البديلة؟',
    'options': [
      'التكلفة التي يتم دفعها عند شراء منتج',
      'التكلفة التي يتم فقدانها عند اتخاذ قرار بديل',
      'التكلفة التي تشمل الرواتب فقط',
      'التكلفة التي تشمل الإيجارات فقط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تحليل نقطة التعادل؟',
    'options': [
      'تحليل لتحديد حجم الإنتاج الذي يحقق الربح',
      'تحليل لتحديد التكلفة الإجمالية للإنتاج',
      'تحليل لتحديد تكاليف الرواتب',
      'تحليل لتحديد تكاليف المواد الخام'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي التكاليف الغارقة؟',
    'options': [
      'التكاليف التي تم دفعها ولا يمكن استردادها',
      'التكاليف التي تتغير مع حجم الإنتاج',
      'التكاليف التي تشمل الرواتب فقط',
      'التكاليف التي تشمل الإيجارات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو نظام التكاليف المستهدفة؟',
    'options': [
      'نظام لتحديد التكاليف بعد الإنتاج',
      'نظام لتحديد التكاليف قبل الإنتاج',
      'نظام لتحديد التكاليف خلال الإنتاج',
      'نظام لتحديد التكاليف بعد البيع'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو الفرق بين التكاليف المشتركة والتكاليف المشتركة القابلة للتوزيع؟',
    'options': [
      'التكاليف المشتركة هي تكاليف غير مباشرة، والتكاليف المشتركة القابلة للتوزيع هي تكاليف مباشرة',
      'التكاليف المشتركة هي تكاليف مباشرة، والتكاليف المشتركة القابلة للتوزيع هي تكاليف غير مباشرة',
      'التكاليف المشتركة لا يمكن تخصيصها لمنتج معين، والتكاليف المشتركة القابلة للتوزيع يمكن تخصيصها',
      'التكاليف المشتركة تشمل الرواتب، والتكاليف المشتركة القابلة للتوزيع تشمل المواد الخام'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الغرض من إعداد الميزانية التقديرية؟',
    'options': [
      'تحقيق الربح',
      'زيادة الإيرادات',
      'تحديد التكاليف والإيرادات المتوقعة',
      'تحسين جودة المنتج'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو نظام التكاليف التقليدي؟',
    'options': [
      'نظام لتحديد التكاليف خلال الإنتاج',
      'نظام لتحديد التكاليف بعد البيع',
      'نظام لتحديد التكاليف قبل الإنتاج',
      'نظام لتحديد التكاليف بعد الإنتاج'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي التكاليف التشغيلية؟',
    'options': [
      'التكاليف المتعلقة بتشغيل وصيانة المعدات',
      'التكاليف المتعلقة بشراء المواد الخام',
      'التكاليف المتعلقة بدفع الرواتب',
      'التكاليف المتعلقة بدفع الإيجارات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام نظام ABC لتخصيص التكاليف؟',
    'options': [
      'تحقيق الربح',
      'زيادة الإيرادات',
      'تخصيص التكاليف بشكل أدق استنادًا إلى الأنشطة',
      'تحسين جودة المنتج'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو تعريف التكاليف المستغرقة؟',
    'options': [
      'التكاليف التي تم دفعها ولا يمكن استردادها',
      'التكاليف التي تتغير مع حجم الإنتاج',
      'التكاليف التي تشمل الرواتب فقط',
      'التكاليف التي تشمل الإيجارات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين التكاليف الثابتة والتكاليف المتغيرة؟',
    'options': [
      'التكاليف الثابتة تتغير مع حجم الإنتاج، والمتغيرة لا تتغير',
      'التكاليف المتغيرة تتغير مع حجم الإنتاج، والثابتة لا تتغير',
      'التكاليف الثابتة تشمل المواد الخام، والمتغيرة تشمل الرواتب',
      'التكاليف الثابتة تشمل الرواتب، والمتغيرة تشمل المواد الخام'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نظام التكاليف المستندة إلى الأنشطة (ABC)؟',
    'options': [
      'نظام لتحديد التكاليف استنادًا إلى الأنشطة',
      'نظام لتحديد التكاليف بعد الإنتاج',
      'نظام لتحديد التكاليف قبل الإنتاج',
      'نظام لتحديد التكاليف خلال الإنتاج'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو تحليل التكلفة والعائد؟',
    'options': [
      'تحليل لتحديد تكاليف الرواتب',
      'تحليل لتحديد تكاليف المواد الخام',
      'تحليل لتقييم الفوائد والتكاليف لاتخاذ قرار معين',
      'تحليل لتحديد التكاليف العامة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو تعريف التكاليف الثابتة؟',
    'options': [
      'التكاليف التي تتغير مع حجم الإنتاج',
      'التكاليف التي لا تتغير مع حجم الإنتاج',
      'التكاليف التي تشمل المواد الخام',
      'التكاليف التي تشمل الرواتب فقط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الغرض من تحليل نقطة التعادل؟',
    'options': [
      'تحليل لتحديد حجم الإنتاج الذي يحقق الربح',
      'تحليل لتحديد التكلفة الإجمالية للإنتاج',
      'تحليل لتحديد تكاليف الرواتب',
      'تحليل لتحديد تكاليف المواد الخام'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو تعريف التكاليف المتغيرة؟',
    'options': [
      'التكاليف التي تشمل الرواتب فقط',
      'التكاليف التي لا تتغير مع حجم الإنتاج',
      'التكاليف التي تتغير مع حجم الإنتاج',
      'التكاليف التي تشمل الإيجارات فقط'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الغرض من استخدام الميزانية التقديرية؟',
    'options': [
      'تحقيق الربح',
      'زيادة الإيرادات',
      'تحديد التكاليف والإيرادات المتوقعة',
      'تحسين جودة المنتج'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين التكاليف المباشرة وغير المباشرة؟',
    'options': [
      'التكاليف المباشرة تشمل الرواتب، وغير المباشرة تشمل المواد الخام',
      'التكاليف غير المباشرة تشمل الرواتب، والمباشرة تشمل المواد الخام',
      'التكاليف المباشرة يمكن تتبعها إلى منتج معين، وغير المباشرة لا يمكن تتبعها',
      'التكاليف المباشرة تشمل الإيجارات، وغير المباشرة تشمل الرواتب'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو تحليل التكلفة والفائدة؟',
    'options': [
      'تحليل لتحديد تكاليف الرواتب',
      'تحليل لتحديد تكاليف المواد الخام',
      'تحليل لتقييم الفوائد والتكاليف لاتخاذ قرار معين',
      'تحليل لتحديد التكاليف العامة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو نظام التكاليف المتغيرة؟',
    'options': [
      'نظام لتحديد التكاليف التي تتغير مع حجم الإنتاج',
      'نظام لتحديد التكاليف بعد الإنتاج',
      'نظام لتحديد التكاليف قبل الإنتاج',
      'نظام لتحديد التكاليف خلال الإنتاج'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من استخدام تحليل نقطة التعادل؟',
    'options': [
      'تحقيق الربح',
      'زيادة الإيرادات',
      'تحديد حجم الإنتاج الذي يحقق الربح',
      'تحسين جودة المنتج'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين التكاليف الثابتة والمتغيرة؟',
    'options': [
      'التكاليف الثابتة تتغير مع حجم الإنتاج، والمتغيرة لا تتغير',
      'التكاليف المتغيرة تتغير مع حجم الإنتاج، والثابتة لا تتغير',
      'التكاليف الثابتة تشمل المواد الخام، والمتغيرة تشمل الرواتب',
      'التكاليف الثابتة تشمل الرواتب، والمتغيرة تشمل المواد الخام'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نظام التكاليف المستهدفة؟',
    'options': [
      'نظام لتحديد التكاليف بعد الإنتاج',
      'نظام لتحديد التكاليف قبل الإنتاج',
      'نظام لتحديد التكاليف خلال الإنتاج',
      'نظام لتحديد التكاليف بعد البيع'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من تحليل الأداء في المحاسبة التكاليفية؟',
    'options': [
      'تحقيق الربح',
      'تحسين أداء المشاركين',
      'زيادة عدد المشاركين',
      'تحليل التكاليف وتحسين الكفاءة'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الفرق بين التكاليف المستغرقة والتكاليف الغارقة؟',
    'options': [
      'التكاليف المستغرقة هي التكاليف التي لا يمكن استردادها، والغارقة هي التكاليف التي يمكن استردادها',
      'التكاليف الغارقة هي التكاليف التي لا يمكن استردادها، والمستغرقة هي التكاليف التي يمكن استردادها',
      'التكاليف المستغرقة تشمل الرواتب، والغارقة تشمل المواد الخام',
      'التكاليف الغارقة تشمل الرواتب، والمستغرقة تشمل المواد الخام'
    ],
    'correctOptionIndex': 1,
  },
];

const List<Map<String, dynamic>> FinanceAccQues = [
  {
    'question': 'ما هو الهدف الرئيسي من المحاسبة المالية؟',
    'options': [
      'تحقيق أرباح كبيرة',
      'تقديم تقارير مالية دقيقة وشفافة',
      'تقليل الضرائب',
      'زيادة الإنتاجية'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question':
        'ما هو البيان المالي الذي يظهر أصول الشركة والتزاماتها وحقوق المساهمين؟',
    'options': [
      'بيان الدخل',
      'بيان التدفقات النقدية',
      'الميزانية العمومية',
      'بيان حقوق المساهمين'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الأصول والخصوم؟',
    'options': [
      'الأصول تشمل الالتزامات، والخصوم تشمل الأصول',
      'الأصول هي ما تملكه الشركة، والخصوم هي ما تدين به الشركة',
      'الأصول هي الديون، والخصوم هي الأرباح',
      'الأصول تشمل الأسهم، والخصوم تشمل السندات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الغرض من إعداد الميزانية العمومية؟',
    'options': [
      'تحديد الأرباح',
      'عرض الأداء المالي للشركة لفترة محددة',
      'تحديد التدفقات النقدية',
      'عرض الوضع المالي للشركة في وقت معين'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو بيان الدخل؟',
    'options': [
      'بيان يظهر الأصول والخصوم',
      'بيان يظهر التدفقات النقدية',
      'بيان يظهر إيرادات الشركة ومصروفاتها وأرباحها',
      'بيان يظهر حقوق المساهمين'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو التدفق النقدي من الأنشطة التشغيلية؟',
    'options': [
      'النقد المتأتي من الأنشطة الاستثمارية',
      'النقد المتأتي من الأنشطة التمويلية',
      'النقد المتأتي من الأنشطة التشغيلية اليومية',
      'النقد المتأتي من بيع الأصول'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الإيرادات والأرباح؟',
    'options': [
      'الإيرادات هي الأرباح قبل خصم التكاليف، والأرباح هي الإيرادات بعد خصم التكاليف',
      'الأرباح هي الإيرادات قبل خصم التكاليف، والإيرادات هي الأرباح بعد خصم التكاليف',
      'الإيرادات تشمل الأصول، والأرباح تشمل الخصوم',
      'الإيرادات تشمل الخصوم، والأرباح تشمل الأصول'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو بيان التدفقات النقدية؟',
    'options': [
      'بيان يظهر أصول الشركة وخصومها',
      'بيان يظهر إيرادات الشركة ومصروفاتها',
      'بيان يظهر التدفقات النقدية الداخلة والخارجة من الشركة',
      'بيان يظهر حقوق المساهمين'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو الفرق بين التدفقات النقدية من الأنشطة الاستثمارية والأنشطة التشغيلية؟',
    'options': [
      'التدفقات من الأنشطة التشغيلية تتعلق بشراء الأصول، والاستثمارية تتعلق بالأنشطة اليومية',
      'التدفقات من الأنشطة التشغيلية تتعلق بالأنشطة اليومية، والاستثمارية تتعلق بشراء الأصول',
      'التدفقات من الأنشطة التشغيلية تتعلق بالتمويل، والاستثمارية تتعلق بالأنشطة اليومية',
      'التدفقات من الأنشطة التشغيلية تتعلق ببيع الأصول، والاستثمارية تتعلق بالتمويل'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تعريف الالتزامات المتداولة؟',
    'options': [
      'الأصول التي يمكن تحويلها إلى نقد في أقل من عام',
      'الديون التي يجب سدادها في أقل من عام',
      'الديون التي تستحق بعد عام',
      'الأصول التي يمكن تحويلها إلى نقد بعد أكثر من عام'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين الأصول الثابتة والأصول المتداولة؟',
    'options': [
      'الثابتة تشمل النقد والمخزون، والمتداولة تشمل المعدات والمباني',
      'الثابتة تشمل المعدات والمباني، والمتداولة تشمل النقد والمخزون',
      'الثابتة تشمل الديون، والمتداولة تشمل الأرباح',
      'الثابتة تشمل الأرباح، والمتداولة تشمل الديون'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو العائد على الاستثمار (ROI)؟',
    'options': [
      'مقياس يحدد نسبة الأرباح إلى التكاليف',
      'مقياس يحدد نسبة الأصول إلى الخصوم',
      'مقياس يحدد نسبة التدفقات النقدية إلى الإيرادات',
      'مقياس يحدد نسبة الإيرادات إلى الأرباح'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين حقوق المساهمين وحقوق الدائنين؟',
    'options': [
      'حقوق المساهمين تشمل الديون، وحقوق الدائنين تشمل الأسهم',
      'حقوق المساهمين تشمل الأسهم، وحقوق الدائنين تشمل الديون',
      'حقوق المساهمين تشمل الأصول، وحقوق الدائنين تشمل الخصوم',
      'حقوق المساهمين تشمل الخصوم، وحقوق الدائنين تشمل الأصول'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو التحليل المالي؟',
    'options': [
      'عملية تحديد التدفقات النقدية',
      'عملية تحديد الأرباح',
      'عملية تحليل البيانات المالية لتقييم الأداء المالي',
      'عملية تحديد الأصول والخصوم'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين النفقات الرأسمالية والنفقات التشغيلية؟',
    'options': [
      'الرأسمالية تشمل النفقات اليومية، والتشغيلية تشمل شراء الأصول',
      'التشغيلية تشمل النفقات اليومية، والرأسمالية تشمل شراء الأصول',
      'الرأسمالية تشمل الإيرادات، والتشغيلية تشمل الأصول',
      'التشغيلية تشمل الإيرادات، والرأسمالية تشمل الأصول'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تعريف السيولة المالية؟',
    'options': [
      'القدرة على تحقيق الأرباح',
      'القدرة على سداد الديون عند استحقاقها',
      'القدرة على زيادة الإيرادات',
      'القدرة على تقليل التكاليف'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين النقدية والنقد المعادل؟',
    'options': [
      'النقدية تشمل الأصول، والنقد المعادل يشمل الخصوم',
      'النقدية تشمل الديون، والنقد المعادل يشمل الأصول',
      'النقدية تشمل النقد الفعلي، والنقد المعادل يشمل الأصول التي يمكن تحويلها إلى نقد بسرعة',
      'النقدية تشمل الأصول التي يمكن تحويلها إلى نقد بسرعة، والنقد المعادل يشمل النقد الفعلي'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين العائد الإجمالي والعائد الصافي؟',
    'options': [
      'الإجمالي يشمل الربح بعد خصم التكاليف، والصافي يشمل الربح قبل خصم التكاليف',
      'الإجمالي يشمل الربح قبل خصم التكاليف، والصافي يشمل الربح بعد خصم التكاليف',
      'الإجمالي يشمل الأصول، والصافي يشمل الخصوم',
      'الإجمالي يشمل الخصوم، والصافي يشمل الأصول'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الغرض من التدقيق المالي؟',
    'options': [
      'تحقيق الأرباح',
      'تحليل البيانات المالية',
      'تقديم تقارير مالية دقيقة وشفافة',
      'زيادة الإيرادات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين التدقيق الداخلي والتدقيق الخارجي؟',
    'options': [
      'الداخلي يتم بواسطة جهات خارجية، والخارجي يتم بواسطة جهات داخلية',
      'الخارجي يتم بواسطة جهات خارجية، والداخلي يتم بواسطة جهات داخلية',
      'الداخلي يشمل الأصول، والخارجي يشمل الخصوم',
      'الخارجي يشمل الأصول، والداخلي يشمل الخصوم'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تعريف الفائض النقدي؟',
    'options': [
      'الفائض الناتج عن الإيرادات',
      'الفائض الناتج عن الديون',
      'الفائض الناتج عن الفرق بين التدفقات النقدية الداخلة والخارجة',
      'الفائض الناتج عن الأصول'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين التخطيط المالي والتنبؤ المالي؟',
    'options': [
      'التخطيط يركز على المستقبل، والتنبؤ يركز على الحاضر',
      'التنبؤ يركز على المستقبل، والتخطيط يركز على الحاضر',
      'التخطيط يشمل الأصول، والتنبؤ يشمل الخصوم',
      'التنبؤ يشمل الأصول، والتخطيط يشمل الخصوم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو العائد على الأصول (ROA)؟',
    'options': [
      'مقياس يحدد نسبة الأرباح إلى الأصول',
      'مقياس يحدد نسبة التدفقات النقدية إلى الأصول',
      'مقياس يحدد نسبة الإيرادات إلى الأصول',
      'مقياس يحدد نسبة الخصوم إلى الأصول'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين الأسهم العادية والأسهم الممتازة؟',
    'options': [
      'العادية تمنح حقوق تصويت، والممتازة لا تمنح حقوق تصويت',
      'الممتازة تمنح حقوق تصويت، والعادية لا تمنح حقوق تصويت',
      'العادية تشمل الأصول، والممتازة تشمل الخصوم',
      'الممتازة تشمل الأصول، والعادية تشمل الخصوم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question':
        'ما هو الفرق بين العائد على الاستثمار (ROI) والعائد على الأصول (ROA)؟',
    'options': [
      'ROI يحدد نسبة الأرباح إلى التكاليف، وROA يحدد نسبة الأرباح إلى الأصول',
      'ROA يحدد نسبة الأرباح إلى التكاليف، وROI يحدد نسبة الأرباح إلى الأصول',
      'ROI يشمل الأصول، وROA يشمل الخصوم',
      'ROA يشمل الأصول، وROI يشمل الخصوم'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من إعداد التقارير المالية؟',
    'options': [
      'زيادة الإيرادات',
      'تحليل البيانات المالية',
      'تقديم معلومات مالية دقيقة لأصحاب المصلحة',
      'تحقيق الأرباح'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين التكلفة الثابتة والتكلفة المتغيرة؟',
    'options': [
      'الثابتة تتغير مع حجم الإنتاج، والمتغيرة تظل ثابتة',
      'المتغيرة تتغير مع حجم الإنتاج، والثابتة تظل ثابتة',
      'الثابتة تشمل الأصول، والمتغيرة تشمل الخصوم',
      'المتغيرة تشمل الأصول، والثابتة تشمل الخصوم'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تعريف العائد على حقوق المساهمين (ROE)؟',
    'options': [
      'مقياس يحدد نسبة الأرباح إلى حقوق المساهمين',
      'مقياس يحدد نسبة التدفقات النقدية إلى حقوق المساهمين',
      'مقياس يحدد نسبة الإيرادات إلى حقوق المساهمين',
      'مقياس يحدد نسبة الخصوم إلى حقوق المساهمين'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين النفقات الاستثمارية والنفقات التشغيلية؟',
    'options': [
      'الاستثمارية تشمل النفقات اليومية، والتشغيلية تشمل شراء الأصول',
      'التشغيلية تشمل النفقات اليومية، والاستثمارية تشمل شراء الأصول',
      'الاستثمارية تشمل الإيرادات، والتشغيلية تشمل الأصول',
      'التشغيلية تشمل الإيرادات، والاستثمارية تشمل الأصول'
    ],
    'correctOptionIndex': 1,
  },
];

const List<Map<String, dynamic>> TaxAccQues = [
  {
    'question': 'ما هو الهدف الرئيسي من المحاسبة الضريبية؟',
    'options': [
      'زيادة الأرباح',
      'إعداد الإقرارات الضريبية وحساب الضرائب المستحقة',
      'تحسين جودة المنتجات',
      'زيادة الإيرادات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الضريبة المباشرة؟',
    'options': [
      'الضريبة التي تفرض على المبيعات',
      'الضريبة التي تفرض على الدخل والأرباح',
      'الضريبة التي تفرض على الواردات',
      'الضريبة التي تفرض على الممتلكات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الضريبة غير المباشرة؟',
    'options': [
      'الضريبة التي تفرض على الدخل والأرباح',
      'الضريبة التي تفرض على المبيعات والسلع والخدمات',
      'الضريبة التي تفرض على الإيجارات',
      'الضريبة التي تفرض على الرواتب'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين الضريبة الثابتة والضريبة التصاعدية؟',
    'options': [
      'الضريبة الثابتة تتغير مع الدخل، والتصاعدية تظل ثابتة',
      'الضريبة التصاعدية تتغير مع الدخل، والثابتة تظل ثابتة',
      'الضريبة الثابتة تفرض على الممتلكات، والتصاعدية على الدخل',
      'الضريبة التصاعدية تفرض على الممتلكات، والثابتة على الدخل'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو تعريف الضريبة على القيمة المضافة؟',
    'options': [
      'ضريبة تفرض على الدخل',
      'ضريبة تفرض على المبيعات',
      'ضريبة تفرض على الأرباح',
      'ضريبة تفرض على الواردات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الغرض من الإعفاء الضريبي؟',
    'options': [
      'زيادة الإيرادات الحكومية',
      'تحفيز الاستثمار والنمو الاقتصادي',
      'زيادة الضرائب على الأفراد',
      'تقليل الإنفاق الحكومي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الخصم الضريبي؟',
    'options': [
      'مبلغ يُخصم من الدخل الخاضع للضريبة',
      'مبلغ يُضاف إلى الدخل الخاضع للضريبة',
      'مبلغ يُدفع كضريبة إضافية',
      'مبلغ يُدفع كغرامة ضريبية'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الضريبة المضافة؟',
    'options': [
      'ضريبة تفرض على الدخل',
      'ضريبة تفرض على المبيعات',
      'ضريبة تفرض على الأرباح',
      'ضريبة تفرض على الواردات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نظام الضرائب التصاعدية؟',
    'options': [
      'نظام تفرض فيه نفس النسبة الضريبية على الجميع',
      'نظام تزداد فيه النسبة الضريبية مع زيادة الدخل',
      'نظام تنخفض فيه النسبة الضريبية مع زيادة الدخل',
      'نظام تفرض فيه النسبة الضريبية على الممتلكات فقط'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الفرق بين الضريبة على المبيعات والضريبة على الدخل؟',
    'options': [
      'الضريبة على المبيعات تفرض على الدخل، والضريبة على الدخل تفرض على المبيعات',
      'الضريبة على المبيعات تفرض على المبيعات، والضريبة على الدخل تفرض على الدخل والأرباح',
      'الضريبة على المبيعات تشمل الرواتب، والضريبة على الدخل تشمل المواد الخام',
      'الضريبة على المبيعات تشمل المواد الخام، والضريبة على الدخل تشمل الرواتب'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الغرض من تقديم الإقرارات الضريبية؟',
    'options': [
      'تحقيق الربح',
      'زيادة الإيرادات',
      'تحديد الضريبة المستحقة ودفعها',
      'تحسين جودة المنتجات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي الضريبة العينية؟',
    'options': [
      'ضريبة تفرض على الدخل والأرباح',
      'ضريبة تفرض على المبيعات والسلع والخدمات',
      'ضريبة تُدفع على شكل سلع أو خدمات بدلاً من النقد',
      'ضريبة تفرض على الممتلكات فقط'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة المباشرة وغير المباشرة؟',
    'options': [
      'الضريبة المباشرة تشمل الرواتب، وغير المباشرة تشمل المواد الخام',
      'الضريبة غير المباشرة تشمل الرواتب، والمباشرة تشمل المواد الخام',
      'الضريبة المباشرة تفرض على الدخل والأرباح، وغير المباشرة تفرض على المبيعات والخدمات',
      'الضريبة المباشرة تشمل الإيجارات، وغير المباشرة تشمل الرواتب'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الإعفاء الضريبي؟',
    'options': [
      'مبلغ يُضاف إلى الدخل الخاضع للضريبة',
      'مبلغ يُخصم من الضريبة المستحقة',
      'مبلغ يُدفع كضريبة إضافية',
      'مبلغ يُدفع كغرامة ضريبية'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو النظام الضريبي التناسبي؟',
    'options': [
      'نظام تفرض فيه نفس النسبة الضريبية على الجميع بغض النظر عن الدخل',
      'نظام تزداد فيه النسبة الضريبية مع زيادة الدخل',
      'نظام تنخفض فيه النسبة الضريبية مع زيادة الدخل',
      'نظام تفرض فيه النسبة الضريبية على الممتلكات فقط'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرض من الضرائب البيئية؟',
    'options': [
      'زيادة الإيرادات الحكومية',
      'تحفيز الاستثمار والنمو الاقتصادي',
      'تقليل التلوث وحماية البيئة',
      'زيادة الضرائب على الأفراد'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة التصاعدية والضريبة التنازلية؟',
    'options': [
      'التصاعدية تزداد مع زيادة الدخل، والتنازلية تنخفض مع زيادة الدخل',
      'التنازلية تزداد مع زيادة الدخل، والتصاعدية تنخفض مع زيادة الدخل',
      'التصاعدية تشمل الرواتب، والتنازلية تشمل المواد الخام',
      'التنازلية تشمل الرواتب، والتصاعدية تشمل المواد الخام'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الخصم الضريبي على الدخل؟',
    'options': [
      'مبلغ يُضاف إلى الدخل الخاضع للضريبة',
      'مبلغ يُخصم من الدخل الخاضع للضريبة',
      'مبلغ يُدفع كضريبة إضافية',
      'مبلغ يُدفع كغرامة ضريبية'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الضريبة على الأرباح الرأسمالية؟',
    'options': [
      'ضريبة تفرض على الدخل',
      'ضريبة تفرض على المبيعات',
      'ضريبة تفرض على الأرباح الناتجة عن بيع الأصول',
      'ضريبة تفرض على الواردات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الإعفاء الضريبي والخصم الضريبي؟',
    'options': [
      'الإعفاء يُضاف إلى الدخل، والخصم يُخصم من الضريبة المستحقة',
      'الإعفاء يُخصم من الضريبة المستحقة، والخصم يُضاف إلى الدخل',
      'الإعفاء يُخصم من الدخل الخاضع للضريبة، والخصم يُخصم من الضريبة المستحقة',
      'الإعفاء يُضاف إلى الدخل، والخصم يُخصم من الدخل الخاضع للضريبة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة العامة والخاصة؟',
    'options': [
      'العامة تفرض على الجميع، والخاصة تفرض على فئة معينة',
      'الخاصة تفرض على الجميع، والعامة تفرض على فئة معينة',
      'العامة تشمل الرواتب، والخاصة تشمل المواد الخام',
      'الخاصة تشمل الرواتب، والعامة تشمل المواد الخام'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الضريبة على الدخل؟',
    'options': [
      'ضريبة تفرض على الأرباح',
      'ضريبة تفرض على المبيعات',
      'ضريبة تفرض على الرواتب والأجور والدخل الشخصي',
      'ضريبة تفرض على الواردات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة الجمركية وضريبة القيمة المضافة؟',
    'options': [
      'الجمركية تفرض على الدخل، والقيمة المضافة تفرض على المبيعات',
      'القيمة المضافة تفرض على الدخل، والجمركية تفرض على الواردات',
      'الجمركية تفرض على الواردات، والقيمة المضافة تفرض على السلع والخدمات',
      'القيمة المضافة تفرض على الواردات، والجمركية تفرض على السلع والخدمات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الضريبة على الثروة؟',
    'options': [
      'ضريبة تفرض على الدخل',
      'ضريبة تفرض على المبيعات',
      'ضريبة تفرض على القيمة الصافية للأصول والممتلكات',
      'ضريبة تفرض على الواردات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة التنازلية والضريبة الثابتة؟',
    'options': [
      'التنازلية تنخفض مع زيادة الدخل، والثابتة تظل ثابتة',
      'الثابتة تنخفض مع زيادة الدخل، والتنازلية تظل ثابتة',
      'التنازلية تشمل الرواتب، والثابتة تشمل المواد الخام',
      'الثابتة تشمل الرواتب، والتنازلية تشمل المواد الخام'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الغرامة الضريبية؟',
    'options': [
      'مبلغ يُخصم من الضريبة المستحقة',
      'مبلغ يُضاف إلى الضريبة المستحقة',
      'مبلغ يُدفع كعقوبة لعدم الامتثال للقوانين الضريبية',
      'مبلغ يُدفع كضريبة إضافية'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة على الدخل والضريبة على الثروة؟',
    'options': [
      'الضريبة على الدخل تفرض على الدخل والأرباح، والضريبة على الثروة تفرض على الأصول والممتلكات',
      'الضريبة على الثروة تفرض على الدخل، والضريبة على الدخل تفرض على الأصول والممتلكات',
      'الضريبة على الدخل تشمل الرواتب، والضريبة على الثروة تشمل المواد الخام',
      'الضريبة على الثروة تشمل الرواتب، والضريبة على الدخل تشمل المواد الخام'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الفرق بين الضريبة على المبيعات وضريبة القيمة المضافة؟',
    'options': [
      'المبيعات تفرض على الدخل، والقيمة المضافة تفرض على المبيعات',
      'القيمة المضافة تفرض على الدخل، والمبيعات تفرض على الواردات',
      'المبيعات تفرض على المبيعات، والقيمة المضافة تفرض على السلع والخدمات',
      'القيمة المضافة تفرض على الواردات، والمبيعات تفرض على السلع والخدمات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة العقارية وضريبة الدخل؟',
    'options': [
      'العقارية تفرض على الدخل، والدخل تفرض على الممتلكات',
      'الدخل تفرض على الدخل، والعقارية تفرض على الممتلكات',
      'العقارية تشمل الرواتب، والدخل تشمل المواد الخام',
      'الدخل تشمل الرواتب، والعقارية تشمل المواد الخام'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نظام الضرائب التنازلية؟',
    'options': [
      'نظام تفرض فيه نفس النسبة الضريبية على الجميع بغض النظر عن الدخل',
      'نظام تزداد فيه النسبة الضريبية مع زيادة الدخل',
      'نظام تنخفض فيه النسبة الضريبية مع زيادة الدخل',
      'نظام تفرض فيه النسبة الضريبية على الممتلكات فقط'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الفرق بين الضريبة على الأرباح وضريبة القيمة المضافة؟',
    'options': [
      'الأرباح تفرض على الدخل، والقيمة المضافة تفرض على المبيعات',
      'القيمة المضافة تفرض على الدخل، والأرباح تفرض على الواردات',
      'الأرباح تفرض على الأرباح الناتجة عن بيع الأصول، والقيمة المضافة تفرض على السلع والخدمات',
      'القيمة المضافة تفرض على الواردات، والأرباح تفرض على السلع والخدمات'
    ],
    'correctOptionIndex': 2,
  },
];
