const List<Map<String, dynamic>> EthicalHackingQues = [
  {
    'question': 'ما هو الهدف الرئيسي لهذه الدورة؟',
    'options': [
      'تعلم البرمجة',
      'حماية البيانات من الاختراقات السيئة',
      'تعلم التصميم الجرافيكي',
      'تعلم التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو النظام المستخدم في الدورة؟',
    'options': ['Windows', 'MacOS', 'Kali Linux', 'Ubuntu'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو البرنامج المستخدم لتثبيت Kali Linux؟',
    'options': ['VirtualBox', 'Vmware', 'Parallels', 'Hyper-V'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي التقنية المستخدمة لرؤية جميع الأجهزة المتصلة بـKali؟',
    'options': ['NMAP', 'Wireshark', 'Netstat', 'Tcpdump'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الهدف من تعلم الهندسة الاجتماعية في هذه الدورة؟',
    'options': [
      'تحسين تصميم المواقع',
      'فهم كيفية خداع الأشخاص للحصول على معلوماتهم',
      'تعلم البرمجة بلغة Python',
      'فهم كيفية إنشاء قواعد بيانات'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الهدف من هذه المحاضرة؟',
    'options': [
      'تعليم البرمجة',
      'تعريف بالاختراق الأخلاقي',
      'تعلم التصميم الجرافيكي',
      'تعلم التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو نوع المخترق الذي يستخدم مهاراته لأهداف غير قانونية؟',
    'options': [
      'White Hat Hacker',
      'Grey Hat Hacker',
      'Black Hat Hacker',
      'Red Hat Hacker'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ماذا يفعل المخترق الأخلاقي؟',
    'options': [
      'يسرق البيانات',
      'يخترق الأنظمة لتحقيق الربح',
      'يحمي الأنظمة والشبكات',
      'يكتب برامج ضارة'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما الذي يجب عليك فعله إذا أردت مشاهدة المزيد من الفيديوهات؟',
    'options': [
      'عدم الاشتراك في القناة',
      'عدم التعليق',
      'الإعجاب، التعليق، والاشتراك',
      'إلغاء الاشتراك'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي أحدى الأهداف الرئيسية للاختراق الأخلاقي؟',
    'options': [
      'سرقة البيانات',
      'تعطيل الأنظمة',
      'التعرف على الثغرات وإصلاحها',
      'نشر الفيروسات'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الموضوع الرئيسي لهذا الفيديو؟',
    'options': [
      'تعلم البرمجة',
      'عرض تطبيق جديد لـ GABT',
      'تعلم التصميم الجرافيكي',
      'تعلم التصوير الفوتوغرافي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما الذي سيتم عرضه في هذا الفيديو؟',
    'options': [
      'كيفية كتابة الكود',
      'كيفية استخدام GABT لتوليد التطبيقات',
      'كيفية تصميم مواقع الويب',
      'كيفية تحرير الصور'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو GABT؟',
    'options': [
      'لغة برمجة',
      'أداة لتوليد التطبيقات',
      'برنامج لتحرير الفيديو',
      'منصة للتواصل الاجتماعي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ماذا سيتم استعراضه في الفيديو؟',
    'options': [
      'أمثلة عن تطبيقات GABT',
      'كيفية كتابة المقالات',
      'كيفية تصميم الشعارات',
      'كيفية تحليل البيانات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي بداية تطبيق GABT في الفيديو؟',
    'options': [
      'تعلم الأساسيات',
      'كيفية توليد تطبيق باستخدام GABT',
      'تعلم البرمجة',
      'تعلم التصميم الجرافيكي'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هي الرسالة الرئيسية في هذا الفيديو؟',
    'options': [
      'شكر المشاهدين على مساعدتهم ودعمهم',
      'تقديم لعبة جديدة',
      'شرح كيفية استخدام الكمبيوتر',
      'تعليم البرمجة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ماذا سيحدث في الفيديو القادم؟',
    'options': [
      'شرح كيفية استخدام الكمبيوتر',
      'تقديم لعبة جديدة',
      'شكر المشاهدين على مساعدتهم',
      'تعليم البرمجة'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما الذي يشكر روبرت المشاهدين عليه؟',
    'options': ['دعمهم', 'مساعدتهم', 'تعليقاتهم', 'جميع ما سبق'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما الذي سيبدأ به روبرت في الفيديو الحالي؟',
    'options': [
      'استخدام الكمبيوتر',
      'تقديم لعبة جديدة',
      'شكر المشاهدين',
      'تعليم البرمجة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو النشاط الرئيسي الذي سيتم عرضه في الفيديو؟',
    'options': [
      'استخدام الكمبيوتر',
      'تقديم لعبة جديدة',
      'شرح كيفية البرمجة',
      'شكر المشاهدين'
    ],
    'correctOptionIndex': 1,
  },
  {
    'question': 'من هو المتحدث الرئيسي في الفيديو؟',
    'options': ['روبرت كونشير', 'عبد النزام قشري', 'طرفين', 'الوزير'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو موضوع الفيديو الذي يقدمه طرفين؟',
    'options': [
      'كيفية صنع الفيديو',
      'شرح نظام لينكس',
      'الحديث عن إرث عروس هايكين',
      'الحرب العالمية المقبلة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما الذي يشكر عبد النزام قشري الجمهور عليه؟',
    'options': [
      'دعمهم وحبهم',
      'مساعدتهم في صنع الفيديو',
      'تعليقاتهم على الفيديو',
      'متابعتهم للقناة'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الرابط المرفق في الوصف؟',
    'options': [
      'لمعرفة المزيد عن لينكس',
      'للتسجيل في دورة تعليمية',
      'لمشاهدة المزيد من الفيديوهات',
      'لشراء منتجات'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'لماذا يريد المتحدثون صنع سور للحرب؟',
    'options': [
      'لتعزيز الأمان',
      'لتعزيز الحرب الحمراء',
      'لمواجهة الحرب العالمية المقبلة',
      'كل ما سبق'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الموضوع الرئيسي للفيديو؟',
    'options': [
      'كيفية تنزيل كالي لينكس واستخدامه على VMware',
      'كيفية تحميل نظام لينكس العادي',
      'كيفية تثبيت ويندوز على جهاز الكمبيوتر',
      'كيفية تشغيل الأفلام باستخدام برنامج OPERA'
    ],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هي الخطوة الأولى لتنزيل كالي لينكس؟',
    'options': [
      'فتح مدير المهام',
      'البحث عن كالي لينكس على OPERA',
      'تحميل برنامج VMware',
      'البحث عن كلمة الافتراضية'
    ],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هي الخطوة الأخيرة قبل تشغيل كالي لينكس على VMware؟',
    'options': [
      'تنزيل كالي لينكس',
      'التأكد من تفعيل خاصية الافتراضية',
      'تحميل VMware',
      'إدخال اسم المستخدم وكلمة المرور'
    ],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو اسم المستخدم الافتراضي لكالي لينكس؟',
    'options': ['Admin', 'User', 'Kali', 'Root'],
    'correctOptionIndex': 2,
  },
  {
    'question':
        'ما هو الحجم الموصى به للذاكرة العشوائية (RAM) لتشغيل كالي لينكس؟',
    'options': ['1 جيجابايت', '2 جيجابايت', '4 جيجابايت', '8 جيجابايت'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الأمر المستخدم لمعرفة الدليل الحالي؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'كيف يمكنك فتح الطرفية باستخدام اختصار لوحة المفاتيح؟',
    'options': ['Ctrl + Alt + T', 'Ctrl + Shift + T', 'Alt + T', 'Shift + T'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لعرض الملفات والمجلدات في الدليل الحالي؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 2,
  },
  {
    'question': 'ما هو الأمر المستخدم لتغيير الدليل الحالي؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'ما هو الأمر المستخدم لإنشاء مجلد جديد؟',
    'options': ['PWD', 'CD', 'LS', 'mkdir'],
    'correctOptionIndex': 3,
  },
  {
    'question': 'ما هو الأمر المستخدم لنسخ الملفات من مكان إلى آخر؟',
    'options': ['mv', 'cp', 'cd', 'cat'],
    'correctOptionIndex': 1,
  },
  {
    'question': 'كيف يمكنك العودة إلى المجلد السابق في الطرفية؟',
    'options': ['cd ..', 'cp', 'mv', 'clear'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لنقل الملفات من مكان إلى آخر؟',
    'options': ['mv', 'cp', 'cd', 'echo'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لمسح الشاشة في الطرفية؟',
    'options': ['clear', 'cat', 'echo', 'cd'],
    'correctOptionIndex': 0,
  },
  {
    'question': 'ما هو الأمر المستخدم لكتابة نص داخل ملف؟',
    'options': ['mv', 'cp', 'echo', 'cat'],
    'correctOptionIndex': 2,
  },
];
